id: pwpolicy_special_character_enforce
title: Require Passwords Contain a Minimum of One Special Character
discussion: |
  The macOS _MUST_ be configured to require at least one special character be used when a password is created.

  Special characters are those characters that are not alphanumeric. Examples include: ~ ! @ # $ % ^ *.

  This rule enforces password complexity by requiring users to set passwords that are less vulnerable to malicious users.

  NOTE: The guidance for password based authentication in NIST 800-53 (Rev 5) and NIST 800-63B state that complexity rules should be organizationally defined. The values defined are based off of common complexity values. But your organization may define its own password complexity rules.
check: "/usr/bin/pwpolicy -getaccountpolicies 2> /dev/null | /usr/bin/tail +2 | /usr/bin/xmllint --xpath 'boolean(//*[contains(text(),\"policyAttributePassword matches '\\''(.*[^a-zA-Z0-9].*){$ODV,}'\\''\")])' -  \n"
result: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-001619
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    sfr:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - IA-5(1)
    800-53r4:
      - IA-5
      - IA-5(1)
    800-171r2:
      - 3.5.1
      - 3.5.2
      - 3.5.7
      - 3.5.8
      - 3.5.9
      - 3.5.10
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
odv:
  hint: Number of special characters.
  recommended: 1
  stig: 1
  cis_lvl1: 1
  cis_lvl2: 1
tags:
  - 800-171
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl2
  - cisv8
  - stig
  - cnssi-1253
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    minComplexChars: $ODV
os_specifics:
  macOS:
    '11.0':
      references:
        disa:
          disa_stig:
            - APPL-11-003011
          srg:
            - SRG-OS-000266-GPOS-00101
          sfr:
            - N/A
        nist:
          cce:
            - CCE-85413-3
        cis:
          benchmark:
            - 5.2.5 (level 2)
          controls v8:
            - 5.2
    '10.15':
      references:
        disa:
          disa_stig:
            - AOSX-15-003011
          srg:
            - SRG-OS-000266-GPOS-00101
          sfr:
            - N/A
        nist:
          cce:
            - CCE-84819-2
        cis:
          benchmark:
            - N/A
          controls v8:
            - 5.2
    '12.0':
      references:
        disa:
          disa_stig:
            - APPL-12-003011
          srg:
            - SRG-OS-000266-GPOS-00101
          sfr:
            - N/A
        nist:
          cce:
            - CCE-91040-6
        cis:
          benchmark:
            - 5.2.5 (level 2)
          controls v8:
            - 5.2
    '13.0':
      references:
        disa:
          disa_stig:
            - N/A
          srg:
            - N/A
          sfr:
            - N/A
        nist:
          cce:
            - CCE-91927-4
        cis:
          benchmark:
            - 5.2.5 (level 2)
          controls v8:
            - 5.2
