id: pwpolicy_account_lockout_enforce
title: Limit Consecutive Failed Login Attempts to $ODV
discussion: "The macOS _MUST_ be configured to limit the number of failed login attempts to a maximum of $ODV. When the maximum number of failed attempts is reached, the account _MUST_ be locked for a period of time after.\n\nThis rule protects against malicious users attempting to gain access to the system via brute-force hacking methods. \n"
check: |
  /usr/bin/pwpolicy -getaccountpolicies 2> /dev/null | /usr/bin/tail +2 | /usr/bin/xmllint --xpath '//dict/key[text()="policyAttributeMaximumFailedAuthentications"]/following-sibling::integer[1]/text()' - | /usr/bin/awk '{ if ($1 <= $ODV) {print "yes"} else {print "no"}}'
result:
  string: 'yes'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  cci:
    - CCI-002238
  800-53r5:
    - AC-7
  800-53r4:
    - AC-7
  srg:
    - $OS_VALUE
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - 3.1.8
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
odv:
  hint: Number of failed attempts.
  recommended: 3
  stig: 3
  cis_lvl1: 5
  cis_lvl2: 5
tags:
  - 800-171
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - stig
  - cis_lvl1
  - cis_lvl2
  - cisv8
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    maxFailedAttempts: $ODV
os_specifics:
  '11.0':
    references:
      cce:
        - CCE-85402-6
      disa_stig:
        - APPL-11-000022
      srg:
        - SRG-OS-000329-GPOS-00128
      cis:
        benchmark:
          - 5.2.1 (level 1)
        controls v8:
          - 6.2
  '12.0':
    references:
      cce:
        - CCE-91029-9
      disa_stig:
        - APPL-12-000022
      srg:
        - SRG-OS-000329-GPOS-00128
      cis:
        benchmark:
          - 5.2.1 (level 1)
        controls v8:
          - 6.2
  '13.0':
    references:
      cce:
        - CCE-91915-9
      disa_stig:
        - N/A
      srg:
        - N/A
      cis:
        benchmark:
          - 5.2.1 (level 1)
        controls v8:
          - 6.2
