id: pwpolicy_simple_sequence_disable
title: Prohibit Repeating, Ascending, and Descending Character Sequences
discussion: |
  The macOS _MUST_ be configured to prohibit the use of repeating, ascending, and descending character sequences when a password is created.

  This rule enforces password complexity by requiring users to set passwords that are less vulnerable to malicious users.

  NOTE: The guidance for password based authentication in NIST 800-53 (Rev 5) and NIST 800-63B state that complexity rules should be organizationally defined. The values defined are based off of common complexity values. But your organization may define its own password complexity rules.
check: |
  /usr/bin/pwpolicy -getaccountpolicies 2> /dev/null | /usr/bin/tail +2 | /usr/bin/xmllint --xpath '//dict/key[text()="policyIdentifier"]/following-sibling::*[1]/text()' - | /usr/bin/grep "allowSimple" -c
result: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - N/A
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    sfr:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - IA-5(1)
    800-53r4:
      - IA-5
      - IA-5(1)
    800-171r2:
      - 3.5.1
      - 3.5.2
      - 3.5.7
      - 3.5.8
      - 3.5.9
      - 3.5.10
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-171
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cisv8
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl2_enterprise
  - ios
  - cis_lvl1_enterprise
  - stig
  - cnssi-1253
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    allowSimple: false
os_specifics:
  macOS:
    '11.0':
      references:
        disa:
          disa_stig:
            - N/A
          srg:
            - SRG-OS-000266-GPOS-00101
          sfr:
            - N/A
        nist:
          cce:
            - CCE-85412-5
        cis:
          benchmark:
            - N/A
          controls v8:
            - 5.2
    '10.15':
      references:
        disa:
          disa_stig:
            - N/A
          srg:
            - SRG-OS-000266-GPOS-00101
          sfr:
            - N/A
        nist:
          cce:
            - CCE-84818-4
        cis:
          benchmark:
            - N/A
          controls v8:
            - 5.2
    '12.0':
      references:
        disa:
          disa_stig:
            - N/A
          srg:
            - N/A
          sfr:
            - N/A
        nist:
          cce:
            - CCE-91039-8
        cis:
          benchmark:
            - N/A
          controls v8:
            - 5.2
    '13.0':
      references:
        disa:
          disa_stig:
            - N/A
          srg:
            - N/A
          sfr:
            - N/A
        nist:
          cce:
            - CCE-91926-6
        cis:
          benchmark:
            - N/A
          controls v8:
            - 5.2
  iOS:
    '16.0':
      references:
        disa:
          disa_stig:
            - AIOS-16-006600
          srg:
            - None
          sfr:
            - 'FMT_SMF_EXT.1.1 #1b'
        nist:
          cce:
            - N/A
        cis:
          benchmark:
            - 2.4.1 (level 1 - End-User Owned Devices)
            - 3.4.1 (level 1 - Institutionally-Owned Devices)
          controls v8:
            - 5.2
