id: pwpolicy_60_day_enforce
title: Restrict Maximum Password Lifetime to 60 Days
discussion: "The macOS _MUST_ be configured to enforce a maximum password lifetime\
  \ limit of at least 60 days. \n\nThis rule ensures that users are forced to change\
  \ their passwords frequently enough to prevent malicious users from gaining and\
  \ maintaining access to the system.\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.mobiledevice.passwordpolicy')\
  .objectForKey('maxPINAgeInDays').js
  EOS
result:
  integer: 60
fix: |
  This is implemented by a Configuration Profile.
references:
  cce: |-
    $OS_VALUE
  cci:
  - CCI-000199
  800-53r5:
  - IA-5
  800-53r4:
  - IA-5
  - IA-5(1)
  srg:
  - SRG-OS-000076-GPOS-00044
  disa_stig: |-
    $OS_VALUE
  800-171r2:
  - 3.5.1
  - 3.5.2
  - 3.5.7
  - 3.5.8
  - 3.5.9
  - 3.5.10
  cis:
    benchmark:
    - N/A
    controls v8:
    - 4.7
tags:
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- 800-171
- cnssi-1253
- 800-53r4_low
- 800-53r4_moderate
- 800-53r4_high
- stig
- cisv8
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    maxPINAgeInDays: 60
OS_specifics:
  macOS:
    '10.15':
      references:
        cce:
        - CCE-84807-7
        disa_stig:
        - AOSX-15-003008
