id: pwpolicy_minimum_length_enforce
title: Require a Minimum Password Length of $ODV Characters
discussion: "The macOS _MUST_ be configured to require a minimum of $ODV characters be used when a password is created.\n\nThis rule enforces password complexity by requiring users to set passwords that are less vulnerable to malicious users. \n\nNOTE: The guidance for password based authentication in NIST 800-53 (Rev 5) and NIST 800-63B state that complexity rules should be organizationally defined. The values defined are based off of common complexity values. But your organization may define its own password complexity rules.\n"
check: "/usr/bin/pwpolicy -getaccountpolicies 2> /dev/null | /usr/bin/tail +2 | /usr/bin/xmllint --xpath 'boolean(//*[contains(text(),\"policyAttributePassword matches '\\''.{$ODV,}'\\''\")])' -    \n"
result: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-000205
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    sfr:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - IA-5(1)
    800-53r4:
      - IA-5
      - IA-5(1)
    800-171r2:
      - 3.5.1
      - 3.5.2
      - 3.5.7
      - 3.5.8
      - 3.5.9
      - 3.5.10
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
odv:
  hint: Minimum password length.
  recommended: 15
  stig: 15
  cis_lvl1: 15
  cis_lvl2: 15
tags:
  - 800-171
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1
  - cis_lvl2
  - cisv8
  - cis_lvl1_byod
  - cis_lvl2_byod
  - stig
  - ios
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cnssi-1253
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    minLength: $ODV
os_specifics:
  macOS:
    '11.0':
      references:
        disa:
          disa_stig:
            - APPL-11-003010
          srg:
            - SRG-OS-000078-GPOS-00046
          sfr:
            - N/A
        nist:
          cce:
            - CCE-85409-1
        cis:
          benchmark:
            - 5.2.2 (level 1)
          controls v8:
            - 5.2
    '10.15':
      references:
        disa:
          disa_stig:
            - AOSX-15-003010
          srg:
            - SRG-OS-000078-GPOS-00046
          sfr:
            - N/A
        nist:
          cce:
            - CCE-84816-8
        cis:
          benchmark:
            - N/A
          controls v8:
            - 5.2
    '12.0':
      references:
        disa:
          disa_stig:
            - APPL-12-003010
          srg:
            - SRG-OS-000078-GPOS-00046
          sfr:
            - N/A
        nist:
          cce:
            - CCE-91036-4
        cis:
          benchmark:
            - 5.2.2 (level 1)
          controls v8:
            - 5.2
    '13.0':
      references:
        disa:
          disa_stig:
            - N/A
          srg:
            - N/A
          sfr:
            - N/A
        nist:
          cce:
            - CCE-91923-3
        cis:
          benchmark:
            - 5.2.2 (level 1)
          controls v8:
            - 5.2
  iOS:
    '16.0':
      references:
        disa:
          disa_stig:
            - AIOS-16-006500
          srg:
            - None
          sfr:
            - 'FMT_SMF_EXT.1.1 #1a'
        nist:
          cce:
            - N/A
        cis:
          benchmark:
            - 2.4.3 (level 1 - End-User Owned Devices)
            - 3.4.3 (level 1 - Institutionally-Owned Devices)
          controls v8:
            - 5.2
