id: pwpolicy_max_lifetime_enforce
title: Restrict Maximum Password Lifetime to $ODV Days
discussion: "The macOS _MUST_ be configured to enforce a maximum password lifetime\
  \ limit of at least $ODV days. \n\nThis rule ensures that users are forced to change\
  \ their passwords frequently enough to prevent malicious users from gaining and\
  \ maintaining access to the system.\n\nNOTE: The guidance for password based authentication\
  \ in NIST 800-53 (Rev 5) and NIST 800-63B state that complexity rules should be\
  \ organizationally defined. The values defined are based off of common complexity\
  \ values. But your organization may define its own password complexity rules.\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.mobiledevice.passwordpolicy')\
  .objectForKey('maxPINAgeInDays').js
  EOS
result:
  integer: $ODV
fix: |
  This is implemented by a Configuration Profile.
references:
  cce: |-
    $OS_VALUE
  cci:
  - CCI-000199
  800-53r5:
  - IA-5
  800-53r4:
  - IA-5
  - IA-5(1)
  srg:
  - SRG-OS-000076-GPOS-00044
  disa_stig: |-
    $OS_VALUE
  800-171r2:
  - 3.5.1
  - 3.5.2
  - 3.5.7
  - 3.5.8
  - 3.5.9
  - 3.5.10
  cis:
    benchmark:
    - N/A
    controls v8:
    - 4.7
odv:
  hint: Number of days.
  default: 60
  stig: 60
tags:
- 800-171
- cnssi-1253
- 800-53r4_low
- 800-53r4_moderate
- 800-53r4_high
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- cisv8
- stig
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    maxPINAgeInDays: $ODV
OS_specifics:
  macOS:
    '12':
      references:
        cce:
        - CCE-91027-3
        disa_stig:
        - APPL-12-003008
    '11':
      references:
        cce:
        - CCE-85400-0
        disa_stig:
        - APPL-11-003008
