id: pwpolicy_simple_sequence_disable
title: Prohibit Repeating, Ascending, and Descending Character Sequences
discussion: |
  The macOS _MUST_ be configured to prohibit the use of repeating, ascending, and descending character sequences when a password is created.

  This rule enforces password complexity by requiring users to set passwords that are less vulnerable to malicious users.

  NOTE: The guidance for password based authentication in NIST 800-53 (Rev 5) and NIST 800-63B state that complexity rules should be organizationally defined. The values defined are based off of common complexity values. But your organization may define its own password complexity rules.
check: |
  /usr/bin/pwpolicy -getaccountpolicies 2> /dev/null | /usr/bin/tail +2 | /usr/bin/xmllint --xpath '//dict/key[text()="policyIdentifier"]/following-sibling::*[1]/text()' - | /usr/bin/grep "allowSimple" -c
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - N/A
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
  nist:
    800-53r5:
      - IA-5(1)
    800-53r4:
      - IA-5
      - IA-5(1)
    800-171r2:
      - 3.5.1
      - 3.5.2
      - 3.5.7
      - 3.5.8
      - 3.5.9
      - 3.5.10
    cce:
      - $OS_VALUE
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-171
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.mobiledevice.passwordpolicy:
    allowSimple: false
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85412-5
        disa_stig:
          - N/A
        srg:
          - SRG-OS-000266-GPOS-00101
        cis:
          benchmark:
            - N/A
          controls v8:
            - 5.2
    '12.0':
      references:
        cce:
          - CCE-91039-8
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - N/A
          controls v8:
            - 5.2
    '13.0':
      references:
        cce:
          - CCE-91926-6
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - N/A
          controls v8:
            - 5.2
