id: auth_smartcard_certificate_trust_enforce_moderate
title: Set Smartcard Certificate Trust to Moderate
discussion: "The macOS system _MUST_ be configured to block access to users who are no longer authorized (i.e., users with revoked certificates).  \n\nTo prevent the use of untrusted certificates, the certificates on a smartcard card _MUST_ meet the following criteria: its issuer has a system-trusted certificate, the certificate is not expired, its \"valid-after\" date is in the past, and it passes Certificate Revocation List (CRL) and Online Certificate Status Protocol (OCSP) checking.\n\nBy setting the smartcard certificate trust level to moderate, the system will execute a soft revocation, i.e., if the OCSP/CRL server is unreachable, authentication will still succeed.\n\nNOTE: Before applying this setting, please see the smartcard supplemental guidance.\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.security.smartcard')\
  .objectForKey('checkCertificateTrust').js
  EOS
result: 2
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-000186
      - CCI-002470
      - CCI-001991
      - CCI-001953
      - CCI-001954
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    sfr:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - IA-5(2)
      - SC-17
    800-53r4:
      - IA-2(12)
      - IA-5(2)
tags:
  - 800-53r4_moderate
  - 800-53r5_moderate
  - stig
  - cnssi-1253
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.security.smartcard:
    checkCertificateTrust: 2
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85279-8
        disa_stig:
          - APPL-11-001060
        srg:
          - SRG-OS-000376-GPOS-00161
          - SRG-OS-000377-GPOS-00162
          - SRG-OS-000384-GPOS-00167
          - SRG-OS-000403-GPOS-00182
          - SRG-OS-000067-GPOS-00035
        sfr:
          - N/A
    '10.15':
      references:
        cce:
          - CCE-84726-9
        disa_stig:
          - AOSX-15-001060
        srg:
          - SRG-OS-000376-GPOS-00161
          - SRG-OS-000377-GPOS-00162
          - SRG-OS-000384-GPOS-00167
          - SRG-OS-000403-GPOS-00182
          - SRG-OS-000067-GPOS-00035
        sfr:
          - N/A
    '12.0':
      references:
        cce:
          - CCE-90882-2
        disa_stig:
          - APPL-12-001060
        srg:
          - SRG-OS-000376-GPOS-00161
          - SRG-OS-000377-GPOS-00162
          - SRG-OS-000384-GPOS-00167
          - SRG-OS-000403-GPOS-00182
          - SRG-OS-000067-GPOS-00035
        sfr:
          - N/A
    '13.0':
      references:
        cce:
          - CCE-91738-5
        disa_stig:
          - N/A
        srg:
          - N/A
        sfr:
          - N/A
