id: auth_smartcard_enforce
title: Enforce Smartcard Authentication
discussion: $OS_VALUE
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.security.smartcard')\
  .objectForKey('enforceSmartCard').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  cci:
    - CCI-000187
    - CCI-000767
    - CCI-000768
  800-53r5:
    - IA-2(1)
    - IA-2(2)
    - IA-2(6)
    - IA-2
    - IA-5(2)
    - IA-2(12)
    - IA-2(8)
  800-53r4:
    - IA-2
    - IA-2(1)
    - IA-2(2)
    - IA-2(3)
    - IA-2(4)
    - IA-2(6)
    - IA-2(11)
    - IA-5(2)
    - IA-5(11)
  srg:
    - $OS_VALUE
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - 3.5.1
    - 3.5.2
    - 3.5.3
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - stig
  - cisv8
severity: high
mobileconfig: true
mobileconfig_info:
  com.apple.security.smartcard:
    enforceSmartCard: true
os_specifics:
  '11.0':
    references:
      cce:
        - CCE-85280-6
      disa_stig:
        - APPL-11-003020
      srg:
        - SRG-OS-000068-GPOS-00036
        - SRG-OS-000107-GPOS-00054
        - SRG-OS-000108-GPOS-00055
      cis:
        benchmark:
          - N/A
        controls v8:
          - 6.3
          - 6.4
          - 6.5
    discussion: "Smartcard authentication _MUST_ be enforced.\n\nThe use of smartcard credentials facilitates standardization and reduces the risk of unauthorized access.\n\nWhen enforceSmartCard is set to \u201Ctrue\u201D, the smartcard must be used for login, authorization, and unlocking the screensaver.\n\nCAUTION: enforceSmartCard will apply to the whole system. No users will be able to login with their password unless the profile is removed or a user is exempt from smartcard enforcement.\n\nNOTE: enforceSmartcard requires allowSmartcard to be set to true in order to work.\n"
  '12.0':
    references:
      cce:
        - CCE-90883-0
      disa_stig:
        - APPL-12-003020
      srg:
        - SRG-OS-000107-GPOS-00054
        - SRG-OS-000108-GPOS-00055
        - SRG-OS-000068-GPOS-00036
      cis:
        benchmark:
          - N/A
        controls v8:
          - 6.3
          - 6.4
          - 6.5
    discussion: |
      Smartcard authentication _MUST_ be enforced.

      The use of smartcard credentials facilitates standardization and reduces the risk of unauthorized access.

      When enforceSmartCard is set to "true", the smartcard must be used for login, authorization, and unlocking the screensaver.

      CAUTION: enforceSmartCard will apply to the whole system. No users will be able to login with their password unless the profile is removed or a user is exempt from smartcard enforcement.

      NOTE: enforceSmartcard requires allowSmartcard to be set to true in order to work.
  '13.0':
    references:
      cce:
        - CCE-91739-3
      disa_stig:
        - N/A
      srg:
        - N/A
      cis:
        benchmark:
          - N/A
        controls v8:
          - 6.3
          - 6.4
          - 6.5
    discussion: |
      Smartcard authentication _MUST_ be enforced.

      The use of smartcard credentials facilitates standardization and reduces the risk of unauthorized access.

      When enforceSmartCard is set to "true", the smartcard must be used for login, authorization, and unlocking the screensaver.

      CAUTION: enforceSmartCard will apply to the whole system. No users will be able to login with their password unless the profile is removed or a user is exempt from smartcard enforcement.

      NOTE: enforceSmartcard requires allowSmartcard to be set to true in order to work.
