id: auth_smartcard_allow
title: Allow Smartcard Authentication
discussion: "Smartcard authentication _MUST_ be allowed. \n\nThe use of smartcard\
  \ credentials facilitates standardization and reduces the risk of unauthorized access.\n\
  \nWhen enabled, the smartcard can be used for login, authorization, and screen saver\
  \ unlocking.\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.security.smartcard')\
  .objectForKey('allowSmartCard').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce: |-
    $OS_VALUE
  cci:
  - N/A
  800-53r5:
  - IA-2(1)
  - IA-2(2)
  - IA-2(12)
  800-53r4:
  - IA-2(12)
  - IA-5(11)
  srg:
  - N/A
  disa_stig: |-
    $OS_VALUE
  cis:
    benchmark:
    - N/A
    controls v8:
    - 6.3
    - 6.4
    - 6.5
tags:
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- 800-53r4_low
- 800-53r4_moderate
- 800-53r4_high
- cnssi-1253
- cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.security.smartcard:
    allowSmartCard: true
OS_specifics:
  macOS:
    '12':
      references:
        cce:
        - CCE-90880-6
        disa_stig:
        - N/A
    '11':
      references:
        cce:
        - CCE-85277-2
        disa_stig:
        - N/A
    '10.15':
      references:
        cce:
        - CCE-84724-4
        disa_stig:
        - N/A
