id: sysprefs_bluetooth_menu_enable
title: Enable Bluetooth Menu
discussion: |
  The bluetooth menu _MUST_ be enabled.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.controlcenter')\
  .objectForKey('Bluetooth').js
  EOS
result:
  integer: 18
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  800-53r5:
    - N/A
  800-53r4:
    - N/A
  srg:
    - $OS_VALUE
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - N/A
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
  cci:
    - None
tags:
  - cis_lvl1
  - cis_lvl2
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.controlcenter:
    Bluetooth: 18
os_specifics:
  '11.0':
    references:
      cce:
        - CCE-85521-3
      disa_stig:
        - N/A
      srg:
        - N/A
      cis:
        benchmark:
          - 2.1.1 (level 1)
        controls v8:
          - 4.8
          - 13.9
  '12.0':
    references:
      cce:
        - CCE-91124-8
      disa_stig:
        - N/A
      srg:
        - N/A
      cis:
        benchmark:
          - 2.1.1 (level 1)
        controls v8:
          - 4.8
          - 13.9
