id: sysprefs_automatic_logout_enforce
title: Enforce Auto Logout After $ODV Seconds of Inactivity
discussion: "Auto logout _MUST_ be configured to automatically terminate a user session and log out the after $ODV seconds of inactivity. \n\nNOTE:The maximum that macOS can be configured for autologoff is $ODV seconds.\n\n[IMPORTANT]\n====\nThe automatic logout may cause disruptions to an organization's workflow and/or loss of data. Information System Security Officers (ISSOs) are advised to first fully weigh the potential risks posed to their organization before opting to disable the automatic logout setting.\n====\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('.GlobalPreferences')\
  .objectForKey('com.apple.autologout.AutoLogOutDelay').js
  EOS
result: $ODV
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-002361
    disa_stig:
      - $OS_VALUE
    srg:
      - $OS_VALUE
    sfr:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - AC-12
      - AC-2(5)
    800-53r4:
      - AC-12
    800-171r2:
      - 3.1.11
odv:
  hint: Number of seconds
  recommended: 86400
tags:
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cnssi-1253
mobileconfig: true
mobileconfig_info:
  .GlobalPreferences:
    com.apple.autologout.AutoLogOutDelay: $ODV
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85424-0
        disa_stig:
          - N/A
        srg:
          - SRG-OS-000279-GPOS-00109
        sfr:
          - N/A
    '10.15':
      references:
        cce:
          - CCE-84870-5
        disa_stig:
          - N/A
        srg:
          - SRG-OS-000279-GPOS-00109
        sfr:
          - N/A
    '12.0':
      references:
        cce:
          - CCE-91047-1
        disa_stig:
          - N/A
        srg:
          - N/A
        sfr:
          - N/A
