id: sysprefs_filevault_enforce
title: Enforce FileVault
discussion: |
  FileVault _MUST_ be enforced.

  The information system implements cryptographic mechanisms to protect the confidentiality and integrity of information stored on digital media during transport outside of controlled areas.
check: |
  dontAllowDisable=$(/usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.MCX')\
  .objectForKey('dontAllowFDEDisable').js
  EOS
  )
  fileVault=$(/usr/bin/fdesetup status | /usr/bin/grep -c "FileVault is On.")
  if [[ "$dontAllowDisable" == "true" ]] && [[ "$fileVault" == 1 ]]; then
    echo "1"
  else
    echo "0"
  fi
result:
  integer: 1
fix: |
  NOTE: See the FileVault supplemental to implement this rule.
references:
  cce:
    - $OS_VALUE
  cci:
    - CCI-001199
    - CCI-002475
    - CCI-002476
  800-53r5:
    - SC-28
    - SC-28(1)
  800-53r4:
    - SC-28
    - SC-28(1)
  srg:
    - $OS_VALUE
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - 3.13.16
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - stig
  - cisv8
  - cis_lvl1
  - cis_lvl2
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.MCX:
    dontAllowFDEDisable: true
os_specifics:
  '11.0':
    references:
      cce:
        - CCE-85425-7
      disa_stig:
        - APPL-11-005020
      srg:
        - SRG-OS-000185-GPOS-00079
        - SRG-OS-000404-GPOS-00183
        - SRG-OS-000405-GPOS-00184
      cis:
        benchmark:
          - 2.5.1.1 (level 1)
        controls v8:
          - 3.6
          - 3.11
  '12.0':
    references:
      cce:
        - CCE-91053-9
      disa_stig:
        - APPL-12-005020
      srg:
        - SRG-OS-000185-GPOS-00079
        - SRG-OS-000404-GPOS-00183
        - SRG-OS-000405-GPOS-00184
      cis:
        benchmark:
          - 2.5.1.1 (level 1)
        controls v8:
          - 3.6
          - 3.11
