id: sysprefs_improve_siri_dictation_disable
title: Disable Sending Siri and Dictation Information to Apple
discussion: "The ability for Apple to store and review audio of your Siri and Dictation interactions _MUST_ be disabled.\n\nThe information system _MUST_ be configured to provide only essential capabilities. Disabling the submission of Siri and Dictation information will mitigate the risk of unwanted data being sent to Apple. \n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.assistant.support')\
  .objectForKey('Siri Data Sharing Opt-In Status').js
  EOS
result: 2
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - N/A
    disa_stig:
      - $OS_VALUE
    srg:
      - $OS_VALUE
    sfr:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - AC-20
      - CM-7
      - CM-7(1)
      - SC-7(10)
    800-53r4:
      - CM-7
      - CM-7(1)
      - AC-20
      - SC-7(10)
    800-171r2:
      - 3.1.20
      - 3.4.6
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cisv8
  - cnssi-1253
mobileconfig: true
mobileconfig_info:
  com.apple.assistant.support:
    Siri Data Sharing Opt-In Status: 2
os_specifics:
  macOS:
    '11.0':
      references:
        disa:
          disa_stig:
            - None
          srg:
            - None
          sfr:
            - N/A
        nist:
          cce:
            - CCE-85432-3
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.1
            - 4.8
    '10.15':
      references:
        disa:
          disa_stig:
            - None
          srg:
            - None
          sfr:
            - N/A
        nist:
          cce:
            - CCE-84912-5
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.1
            - 4.8
    '12.0':
      references:
        disa:
          disa_stig:
            - None
          srg:
            - None
          sfr:
            - N/A
        nist:
          cce:
            - CCE-91062-0
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.1
            - 4.8
