id: sysprefs_internet_sharing_disable
title: Disable Internet Sharing
discussion: |
  If the system does not require Internet sharing, support for it is non-essential and _MUST_ be disabled.

  The information system _MUST_ be configured to provide only essential capabilities. Disabling Internet sharing helps prevent the unauthorized connection of devices, unauthorized transfer of information, and unauthorized tunneling.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.MCX')\
  .objectForKey('forceInternetSharingOff').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce: |-
    $OS_VALUE
  cci:
  - CCI-000381
  800-53r5:
  - AC-4
  - AC-20
  800-53r4:
  - AC-4
  - AC-20
  srg:
  - SRG-OS-000095-GPOS-00049
  disa_stig: |-
    $OS_VALUE
  800-171r2:
  - 3.1.3
  - 3.1.20
  cis:
    benchmark:
    - 2.4.2 (level 1)
    controls v8:
    - 4.1
    - 4.8
tags:
- 800-53r5_low
- 800-53r4_low
- 800-53r4_moderate
- 800-53r4_high
- 800-53r5_moderate
- 800-53r5_high
- 800-171
- cnssi-1253
- cis_lvl1
- cis_lvl2
- cisv8
- stig
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.MCX:
    forceInternetSharingOff: true
OS_specifics:
  macOS:
    '12':
      references:
        cce:
        - CCE-91063-8
        disa_stig:
        - APPL-12-002007
    '11':
      references:
        cce:
        - CCE-85433-1
        disa_stig:
        - APPL-11-002007
    '10.15':
      references:
        cce:
        - CCE-84837-4
        disa_stig:
        - AOSX-15-002007
