id: sysprefs_internet_accounts_prefpane_disable
title: Disable the Internet Accounts System Preference Pane
discussion: |
  The Internet Accounts System Preference pane _MUST_ be disabled to prevent the addition of unauthorized internet accounts.

  [IMPORTANT]
  ====
  Some organizations may allow the use and configuration of the built-in Mail.app, Calendar.app, and Contacts.app for organizational communication. Information System Security Officers (ISSOs) may make the risk-based decision not to disable the Internet Accounts System Preference pane to avoid losing this functionality, but they are advised to first fully weigh the potential risks posed to their organization.
  ====
check: |
  /usr/bin/profiles show -output stdout-xml | /usr/bin/xmllint --xpath '//key[text()="DisabledPreferencePanes"]/following-sibling::*[1]' - | /usr/bin/grep -c com.apple.preferences.internetaccounts
result: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-001774
      - CCI-000381
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    sfr:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - CM-7(5)
      - AC-20
    800-53r4:
      - AC-20
      - CM-7(5)
    800-171r2:
      - 3.1.20
cis:
  benchmark:
    - N/A
  controls v8:
    - 4.8
    - 15.2
tags:
  - 800-53r5_low
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-171
  - cisv8
  - stig
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.systempreferences:
    DisabledPreferencePanes:
      - com.apple.preferences.internetaccounts
os_specifics:
  macOS:
    '11.0':
      references:
        disa:
          disa_stig:
            - APPL-11-002032
          srg:
            - SRG-OS-000095-GPOS-00049
            - SRG-OS-000370-GPOS-00155
          sfr:
            - N/A
        nist:
          cce:
            - CCE-85328-3
    '12.0':
      references:
        disa:
          disa_stig:
            - APPL-12-002032
          srg:
            - SRG-OS-000370-GPOS-00155
            - SRG-OS-000095-GPOS-00049
          sfr:
            - N/A
        nist:
          cce:
            - CCE-90938-2
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.8
            - 15.2
