id: sysprefs_touchid_prefpane_disable
title: Disable the System Preference Pane for Touch ID
discussion: "The system preference pane for Touch ID _MUST_ be disabled.\n\nDisabling the system preference pane prevents the users from configuring Touch ID. \n"
check: $OS_VALUE
result: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-001774
      - CCI-000381
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    sfr:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - CM-7
      - CM-7(5)
    800-53r4:
      - CM-7
      - CM-7(5)
    800-171r2:
      - N/A
tags:
  - stig
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.systempreferences:
    DisabledPreferencePanes:
      - com.apple.preferences.password
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85488-5
        disa_stig:
          - APPL-11-002051
        srg:
          - SRG-OS-000095-GPOS-00049
        sfr:
          - N/A
      check: "/usr/bin/profiles show -output stdout-xml | /usr/bin/xmllint --xpath '//key[text()=\"DisabledPreferencePanes\"]/following-sibling::*[1]' - | /usr/bin/grep -c com.apple.preferences.password \n"
    '12.0':
      references:
        cce:
          - CCE-91144-6
        disa_stig:
          - APPL-12-002051
        srg:
          - SRG-OS-000095-GPOS-00049
        sfr:
          - N/A
      check: |
        /usr/bin/profiles show -output stdout-xml | /usr/bin/xmllint --xpath '//key[text()="DisabledPreferencePanes"]/following-sibling::*[1]' - | /usr/bin/grep -c com.apple.preferences.password
