id: sysprefs_guest_account_disable
title: Disable the Guest Account
discussion: "Guest access _MUST_ be disabled. \n\nTurning off guest access prevents anonymous users from accessing files.\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  function run() {
    let pref1 = ObjC.unwrap($.NSUserDefaults.alloc.initWithSuiteName('com.apple.MCX')\
  .objectForKey('DisableGuestAccount'))
    let pref2 = ObjC.unwrap($.NSUserDefaults.alloc.initWithSuiteName('com.apple.MCX')\
  .objectForKey('EnableGuestAccount'))
    if ( pref1 == true && pref2 == false ) {
      return("true")
    } else {
      return("false")
    }
  }
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  cci:
    - CCI-001813
  800-53r5:
    - AC-2
    - AC-2(9)
  800-53r4:
    - AC-2
    - AC-2(9)
  srg:
    - $OS_VALUE
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - 3.5.1
    - 3.5.2
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - stig
  - cisv8
  - cis_lvl1
  - cis_lvl2
severity: high
mobileconfig: true
mobileconfig_info:
  com.apple.MCX:
    DisableGuestAccount: true
    EnableGuestAccount: false
os_specifics:
  '11.0':
    references:
      cce:
        - CCE-85320-0
      disa_stig:
        - APPL-11-002063
      srg:
        - SRG-OS-000364-GPOS-00151
      cis:
        benchmark:
          - 6.1.3 (level 1)
        controls v8:
          - 5.2
          - 5.3
          - 6.8
  '12.0':
    references:
      cce:
        - CCE-91060-4
      disa_stig:
        - APPL-12-002063
      srg:
        - SRG-OS-000364-GPOS-00151
      cis:
        benchmark:
          - 6.1.3 (level 1)
        controls v8:
          - 5.2
          - 5.3
          - 6.8
