id: sysprefs_screensaver_password_enforce
title: Enforce Screen Saver Password
discussion: "Users _MUST_ authenticate when unlocking the screen saver. \n\nThe screen\
  \ saver acts as a session lock and prevents unauthorized users from accessing the\
  \ current user's account.\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.screensaver')\
  .objectForKey('askForPassword').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce: |-
    $OS_VALUE
  cci:
  - CCI-000056
  800-53r5:
  - AC-11
  800-53r4:
  - AC-11
  srg:
  - SRG-OS-000028-GPOS-00009
  disa_stig: |-
    $OS_VALUE
  800-171r2:
  - 3.1.10
tags:
- 800-53r5_moderate
- 800-53r5_high
- 800-53r4_moderate
- 800-53r4_high
- 800-171
- cnssi-1253
- stig
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.screensaver:
    askForPassword: true
OS_specifics:
  macOS:
    '12':
      references:
        cce:
        - CCE-91073-7
        disa_stig:
        - APPL-12-000002
    '11':
      references:
        cce:
        - CCE-85443-0
        disa_stig:
        - APPL-11-000002
    '10.15':
      references:
        cce:
        - CCE-84787-1
        disa_stig:
        - AOSX-15-000002
