id: sysprefs_screensaver_timeout_enforce
title: Enforce Screen Saver Timeout
discussion: "The screen saver timeout _MUST_ be set to $ODV seconds or a shorter length of time. \n\nThis rule ensures that a full session lock is triggered within no more than $ODV seconds of inactivity.\n"
check: $OS_VALUE
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  cci:
    - CCI-000057
  800-53r5:
    - AC-11
    - IA-11
  800-53r4:
    - AC-11
  srg:
    - $OS_VALUE
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - 3.1.10
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
odv:
  hint: Number of seconds.
  recommended: 1200
  stig: 900
  cis_lvl1: 1200
  cis_lvl2: 1200
tags:
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r5_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - stig
  - cis_lvl1
  - cis_lvl2
  - cisv8
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.screensaver:
    idleTime: $ODV
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85444-8
        disa_stig:
          - APPL-11-000004
        srg:
          - SRG-OS-000029-GPOS-00010
        cis:
          benchmark:
            - 2.3.1 (level 1)
          controls v8:
            - 4.3
      check: |
        /usr/bin/osascript -l JavaScript << EOS
        function run() {
          let timeout = ObjC.unwrap($.NSUserDefaults.alloc.initWithSuiteName('com.apple.screensaver')\
          .objectForKey('idleTime'))
          if ( timeout <= $ODV ) {
            return("true")
          } else {
            return("false")
          }
        }
        EOS
    '12.0':
      references:
        cce:
          - CCE-91074-5
        disa_stig:
          - APPL-12-000004
        srg:
          - SRG-OS-000029-GPOS-00010
        cis:
          benchmark:
            - 2.3.1 (level 1)
          controls v8:
            - 4.3
      check: |
        /usr/bin/osascript -l JavaScript << EOS
        function run() {
          let timeout = ObjC.unwrap($.NSUserDefaults.alloc.initWithSuiteName('com.apple.screensaver')\
        .objectForKey('idleTime'))
          if ( timeout <= $ODV ) {
            return("true")
          } else {
            return("false")
          }
        }
        EOS
