id: sysprefs_screensaver_ask_for_password_delay_enforce
title: Enforce Session Lock After Screen Saver is Started
discussion: "A screen saver _MUST_ be enabled and the system _MUST_ be configured\
  \ to require a password to unlock once the screensaver has been on for a maximum\
  \ of $ODV seconds. \n\nAn unattended system with an excessive grace period is vulnerable\
  \ to a malicious user. \n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.screensaver')\
  .objectForKey('askForPasswordDelay').js
  EOS
result:
  integer: $ODV
fix: |
  This is implemented by a Configuration Profile.
references:
  cce: |-
    $OS_VALUE
  cci:
  - CCI-000056
  800-53r5:
  - AC-11
  800-53r4:
  - AC-11
  srg:
  - SRG-OS-000028-GPOS-00009
  disa_stig: |-
    $OS_VALUE
  800-171r2:
  - 3.1.10
  cis:
    benchmark:
    - 5.8 (level 1)
    controls v8:
    - 4.7
odv:
  hint: Number of seconds.
  default: 5
  stig: 5
  cis_lvl1: 5
  cis_lvl2: 5
tags:
- 800-53r5_moderate
- 800-53r5_high
- 800-53r4_moderate
- 800-53r4_high
- 800-171
- cnssi-1253
- cis_lvl1
- cis_lvl2
- cisv8
- stig
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.screensaver:
    askForPasswordDelay: $ODV
OS_specifics:
  macOS:
    '12':
      references:
        cce:
        - CCE-91072-9
        disa_stig:
        - APPL-12-000003
    '11':
      references:
        cce:
        - CCE-85442-2
        disa_stig:
        - APPL-11-000003
    '10.15':
      references:
        cce:
        - CCE-84785-5
        disa_stig:
        - AOSX-15-000003
