id: sysprefs_screensaver_enforce
title: Enforce Screen Saver
discussion: |
  A default screen saver _MUST_ be configured to display and _MUST_ not display any sensitive information.
check: |
  /usr/bin/profiles -P -o stdout  | /usr/bin/grep -c modulePath
result: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-000060
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    sfr:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - N/A
    800-53r4:
      - N/A
    800-171r2:
      - N/A
tags:
  - stig
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.screensaver.user:
    modulePath: /System/Library/Screen Savers/Flurry.saver
os_specifics:
  macOS:
    '10.15':
      references:
        disa:
          disa_stig:
            - AOSX-15-000006
          srg:
            - SRG-OS-000031-GPOS-00012
          sfr:
            - N/A
        nist:
          cce:
            - CCE-84921-6
