id: sysprefs_apple_watch_unlock_disable
title: Prevent Apple Watch from Terminating a Session Lock
discussion: |
  Apple Watches are not an approved authenticator and their use _MUST_ be disabled.

  Disabling Apple watches is a necessary step to ensuring that the information system retains a session lock until the user reestablishes access using an authorized identification and authentication procedures.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowAutoUnlock').js
  EOS
result: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-000056
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    sfr:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - AC-11
    800-53r4:
      - AC-11
    800-171r2:
      - 3.1.10
tags:
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - stig
  - cnssi-1253
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAutoUnlock: false
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85418-2
        disa_stig:
          - APPL-11-000001
        srg:
          - SRG-OS-000028-GPOS-00009
        sfr:
          - N/A
    '10.15':
      references:
        cce:
          - CCE-84824-2
        disa_stig:
          - AOSX-15-000001
        srg:
          - SRG-OS-000028-GPOS-00009
        sfr:
          - N/A
    '12.0':
      references:
        cce:
          - CCE-91045-5
        disa_stig:
          - APPL-12-000001
        srg:
          - SRG-OS-000028-GPOS-00009
        sfr:
          - N/A
