id: sysprefs_token_removal_enforce
title: Configure User Session Lock When a Smart Token is Removed
discussion: "The screen lock _MUST_ be configured to initiate automatically when the\
  \ smart token is removed from the system.\n\nSession locks are temporary actions\
  \ taken when users stop work and move away from the immediate vicinity of the information\
  \ system but do not want to log out because of the temporary nature of their absences.\
  \ While a session lock is not an acceptable substitute for logging out of an information\
  \ system for longer periods of time, they prevent a malicious user from accessing\
  \ the information system when a user has removed their smart token. \n\n[IMPORTANT]\n\
  ====\nInformation System Security Officers (ISSOs) may make the risk-based decision\
  \ not to enforce a session lock when a smart token is removed, so as to maintain\
  \ necessary workflow capabilities, but they are advised to first fully weigh the\
  \ potential risks posed to their organization. \n====\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.security.smartcard')\
  .objectForKey('tokenRemovalAction').js
  EOS
result:
  integer: 1
fix: |-
  This is implemented by a Configuration Profile.
references:
  cce: |-
    $OS_VALUE
  cci:
  - CCI-000058
  800-53r5:
  - AC-11
  800-53r4:
  - AC-11
  srg:
  - SRG-OS-000030-GPOS-00011
  disa_stig: |-
    $OS_VALUE
  800-171r2:
  - 3.1.10
tags:
- 800-53r5_moderate
- 800-53r5_high
- 800-53r4_moderate
- 800-53r4_high
- 800-171
- cnssi-1253
- stig
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.security.smartcard:
    tokenRemovalAction: 1
OS_specifics:
  macOS:
    '12':
      references:
        cce:
        - CCE-91082-8
        disa_stig:
        - APPL-12-000005
    '11':
      references:
        cce:
        - CCE-85450-5
        disa_stig:
        - APPL-11-000005
    '10.15':
      references:
        cce:
        - CCE-84848-1
        disa_stig:
        - AOSX-15-000005
