id: sysprefs_screensaver_password_enforce
title: Enforce Screen Saver Password
discussion: "Users _MUST_ authenticate when unlocking the screen saver. \n\nThe screen saver acts as a session lock and prevents unauthorized users from accessing the current user's account.\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.screensaver')\
  .objectForKey('askForPassword').js
  EOS
result: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-000056
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    sfr:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - AC-11
    800-53r4:
      - AC-11
    800-171r2:
      - 3.1.10
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cis_lvl1
  - cis_lvl2
  - cisv8
  - stig
  - cnssi-1253
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.screensaver:
    askForPassword: true
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85443-0
        disa_stig:
          - APPL-11-000002
        srg:
          - SRG-OS-000028-GPOS-00009
        sfr:
          - N/A
        cis:
          benchmark:
            - 2.5.10 (level 1)
          controls v8:
            - 4.7
    '10.15':
      references:
        cce:
          - CCE-84787-1
        disa_stig:
          - AOSX-15-000002
        srg:
          - SRG-OS-000028-GPOS-00009
        sfr:
          - N/A
    '12.0':
      references:
        cce:
          - CCE-91073-7
        disa_stig:
          - APPL-12-000002
        srg:
          - SRG-OS-000028-GPOS-00009
        sfr:
          - N/A
        cis:
          benchmark:
            - 2.5.10 (level 1)
          controls v8:
            - 4.7
