id: sysprefs_screensaver_ask_for_password_delay_enforce
title: Enforce Session Lock After Screen Saver is Started
discussion: "A screen saver _MUST_ be enabled and the system _MUST_ be configured to require a password to unlock once the screensaver has been on for a maximum of $ODV seconds. \n\nAn unattended system with an excessive grace period is vulnerable to a malicious user. \n"
check: $OS_VALUE
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  cci:
    - CCI-000056
  800-53r5:
    - AC-11
  800-53r4:
    - AC-11
  srg:
    - $OS_VALUE
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - 3.1.10
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
odv:
  hint: Number of seconds.
  recommended: 5
  stig: 5
  cis_lvl1: 5
  cis_lvl2: 5
tags:
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - stig
  - cis_lvl1
  - cis_lvl2
  - cisv8
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.screensaver:
    askForPasswordDelay: $ODV
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85442-2
        disa_stig:
          - APPL-11-000003
        srg:
          - SRG-OS-000028-GPOS-00009
        cis:
          benchmark:
            - 2.5.10 (level 1)
          controls v8:
            - 4.7
      check: |
        /usr/bin/osascript -l JavaScript << EOS
        function run() {
         let delay = ObjC.unwrap($.NSUserDefaults.alloc.initWithSuiteName('com.apple.screensaver')\
         .objectForKey('askForPasswordDelay'))
          if ( delay <= $ODV ) {
            return("true")
          } else {
            return("false")
          }
        }
        EOS
    '12.0':
      references:
        cce:
          - CCE-91072-9
        disa_stig:
          - APPL-12-000003
        srg:
          - SRG-OS-000028-GPOS-00009
        cis:
          benchmark:
            - 2.5.10 (level 1)
          controls v8:
            - 4.7
      check: |
        /usr/bin/osascript -l JavaScript << EOS
        function run() {
          let delay = ObjC.unwrap($.NSUserDefaults.alloc.initWithSuiteName('com.apple.screensaver')\
        .objectForKey('askForPasswordDelay'))
          if ( delay <= $ODV ) {
            return("true")
          } else {
            return("false")
          }
        }
        EOS
