id: sysprefs_time_machine_auto_backup_enable
title: Configure Time Machine for Automatic Backups
discussion: "Automatic backups _MUST_ be enabled when using Time Machine. \n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.TimeMachine')\
  .objectForKey('AutoBackup').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce: |-
    $OS_VALUE
  cci:
  - N/A
  800-53r5:
  - N/A
  800-53r4:
  - N/A
  srg:
  - N/A
  disa_stig: |-
    $OS_VALUE
  800-171r2:
  - N/A
  cis:
    benchmark:
    - 2.7.1 (level 2)
    controls v8:
    - 11.2
tags:
- cis_lvl2
- cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.TimeMachine:
    AutoBackup: true
OS_specifics:
  macOS:
    '12':
      references:
        cce:
        - CCE-91142-0
        disa_stig:
        - N/A
    '11':
      references:
        cce:
        - CCE-85535-3
        disa_stig:
        - N/A
