id: sysprefs_automatic_login_disable
title: Disable Unattended or Automatic Logon to the System
discussion: |
  Automatic logon _MUST_ be disabled.

  When automatic logons are enabled, the default user account is automatically logged on at boot time without prompting the user for a password. Even if the screen is later locked, a malicious user would be able to reboot the computer and find it already logged in. Disabling automatic logons mitigates this risk.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.loginwindow')\
  .objectForKey('com.apple.login.mcx.DisableAutoLoginClient').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-000366
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
  nist:
    800-53r5:
      - IA-2
      - IA-5(13)
    800-53r4:
      - IA-2
      - IA-5(13)
    800-171r2:
      - 3.5.1
      - 3.5.2
  cce:
    - $OS_VALUE
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - stig
  - cis_lvl1
  - cis_lvl2
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.loginwindow:
    com.apple.login.mcx.DisableAutoLoginClient: true
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85419-0
        disa_stig:
          - APPL-11-002066
        srg:
          - SRG-OS-000480-GPOS-00229
        cis:
          benchmark:
            - 5.6 (level 1)
          controls v8:
            - 4.7
    '12.0':
      references:
        cce:
          - CCE-91046-3
        disa_stig:
          - APPL-12-002066
        srg:
          - SRG-OS-000480-GPOS-00229
        cis:
          benchmark:
            - 5.6 (level 1)
          controls v8:
            - 4.7
