id: sysprefs_bluetooth_disable
title: Disable Bluetooth When no Approved Device is Connected
discussion: "The macOS system _MUST_ be configured to disable Bluetooth unless there is an approved device connected.\n\n[IMPORTANT]\n====\nInformation System Security Officers (ISSOs) may make the risk-based decision not to disable Bluetooth, so as to maintain necessary functionality, but they are advised to first fully weigh the potential risks posed to their organization. \n====\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.MCXBluetooth')\
  .objectForKey('DisableBluetooth').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  cci:
    - CCI-002418
  800-53r5:
    - AC-18
    - SC-8
    - AC-18(3)
  800-53r4:
    - AC-18(3)
    - SC-8
  srg:
    - $OS_VALUE
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - 3.13.8
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-171
  - stig
  - cisv8
severity: low
mobileconfig: true
mobileconfig_info:
  com.apple.ManagedClient.preferences:
    com.apple.MCXBluetooth:
      DisableBluetooth: true
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85420-8
        disa_stig:
          - APPL-11-002062
        srg:
          - SRG-OS-000481-GPOS-00481
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.8
            - 12.6
            - 13.9
    '12.0':
      references:
        cce:
          - CCE-91048-9
        disa_stig:
          - APPL-12-002062
        srg:
          - SRG-OS-000481-GPOS-000481
          - SRG-OS-000319-GPOS-00164
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.8
            - 12.6
            - 13.9
