id: sysprefs_firewall_stealth_mode_enable
title: Enable Firewall Stealth Mode
discussion: "Firewall Stealth Mode _MUST_ be enabled. \n\nWhen stealth mode is enabled,\
  \ the Mac will not respond to any probing requests, and only requests from authorized\
  \ applications will still be authorized.\n\n[IMPORTANT]\n====\nEnabling firewall\
  \ stealth mode may prevent certain remote mechanisms used for maintenance and compliance\
  \ scanning from properly functioning. Information System Security Officers (ISSOs)\
  \ are advised to first fully weigh the potential risks posed to their organization\
  \ before opting not to enable stealth mode.\n====\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.security.firewall')\
  .objectForKey('EnableStealthMode').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce: |-
    $OS_VALUE
  800-53r5:
  - CM-7
  - CM-7(1)
  - SC-7(16)
  - SC-7
  800-53r4:
  - SC-7
  - CM-7
  - CM-7(1)
  - SC-7(16)
  srg:
  - SRG-OS-000480-GPOS-00232
  disa_stig: |-
    $OS_VALUE
  800-171r2:
  - 3.4.6
  - 3.13.1
  - 3.13.2
  - 3.13.5
  cis:
    benchmark:
    - 2.5.2.3 (level 1)
    controls v8:
    - 4.1
    - 4.5
    - 4.8
tags:
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- 800-53r4_low
- 800-53r4_moderate
- 800-53r4_high
- 800-171
- cnssi-1253
- cis_lvl1
- cis_lvl2
- cisv8
- stig
- stig
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.security.firewall:
    EnableStealthMode: true
OS_specifics:
  macOS:
    '12':
      references:
        cce:
        - CCE-91056-2
        disa_stig:
        - APPL-12-005050
    '11':
      references:
        cce:
        - CCE-85428-1
        disa_stig:
        - APPL-11-005050
    '10.15':
      references:
        cce:
        - CCE-84833-3
        disa_stig:
        - AOSX-15-005050
