id: sysprefs_siri_prefpane_hide
title: Hide the System Preference Pane for Siri
discussion: $OS_VALUE
check: |
  /usr/bin/profiles show -output stdout-xml | /usr/bin/xmllint --xpath '//key[text()="HiddenPreferencePanes"]/following-sibling::*[1]' - | /usr/bin/grep -c com.apple.preference.speech
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  cci:
    - CCI-001774
    - CCI-000381
  800-53r5:
    - CM-7
    - CM-7(5)
  800-53r4:
    - CM-7
    - CM-7(5)
  srg:
    - $OS_VALUE
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - N/A
tags:
  - stig
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.systempreferences:
    HiddenPreferencePanes:
      - com.apple.preference.speech
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85491-9
        disa_stig:
          - APPL-11-002053
        srg:
          - SRG-OS-000095-GPOS-00049
      discussion: "The system preference pane for Siri _MUST_ be hidden.\n\nHiding the system preference pane prevents the users from configuring Siri. \n"
    '12.0':
      references:
        cce:
          - CCE-91137-0
        disa_stig:
          - APPL-12-002053
        srg:
          - SRG-OS-000095-GPOS-00049
      discussion: "The system preference pane for Siri _MUST_ be hidden.\n\nHIding the system preference pane prevents the users from configuring Siri. \n"
