id: sysprefs_password_hints_disable
title: Disable Password Hints
discussion: "Password hints _MUST_ be disabled.\n\nPassword hints leak information about passwords that are currently in use and can lead to loss of confidentiality. \n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.loginwindow')\
  .objectForKey('RetriesUntilHint').js
  EOS
result:
  integer: 0
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  cci:
    - CCI-000366
  800-53r5:
    - IA-6
  800-53r4:
    - IA-6
  srg:
    - $OS_VALUE
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - 3.5.11
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - stig
  - cis_lvl1
  - cis_lvl2
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.loginwindow:
    RetriesUntilHint: 0
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85437-2
        disa_stig:
          - APPL-11-003012
        srg:
          - SRG-OS-000480-GPOS-00227
        cis:
          benchmark:
            - 6.1.2 (level 1)
          controls v8:
            - 4.1
    '12.0':
      references:
        cce:
          - CCE-91067-9
        disa_stig:
          - APPL-12-003012
        srg:
          - SRG-OS-000480-GPOS-00227
        cis:
          benchmark:
            - 6.1.2 (level 1)
          controls v8:
            - 4.1
