id: sysprefs_bluetooth_prefpane_disable
title: Disable the Bluetooth System Preference Pane
discussion: |
  The Bluetooth System Preference pane _MUST_ be disabled to prevent access to the bluetooth configuration.
check: |
  /usr/bin/profiles show -output stdout-xml | /usr/bin/xmllint --xpath '//key[text()="DisabledPreferencePanes"]/following-sibling::*[1]' - | /usr/bin/grep -c com.apple.preferences.Bluetooth
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  cci:
    - CCI-002418
  800-53r5:
    - N/A
  800-53r4:
    - SC-8
  srg:
    - $OS_VALUE
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - N/A
tags:
  - stig
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.systempreferences:
    DisabledPreferencePanes:
      - com.apple.preferences.Bluetooth
os_specifics:
  '11.0':
    references:
      cce:
        - CCE-85492-7
      disa_stig:
        - APPL-11-002062
      srg:
        - SRG-OS-000481-GPOS-00481
  '12.0':
    references:
      cce:
        - CCE-91150-3
      disa_stig:
        - APPL-12-002062
      srg:
        - SRG-OS-000481-GPOS-000481
