id: sysprefs_firewall_enable
title: Enable macOS Application Firewall
discussion: "The macOS Application Firewall is the built-in firewall that comes with\
  \ macOS, and it _MUST_ be enabled. \n\nWhen the macOS Application Firewall is enabled,\
  \ the flow of information within the information system and between interconnected\
  \ systems will be controlled by approved authorizations.\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.security.firewall')\
  .objectForKey('EnableFirewall').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce: |-
    $OS_VALUE
  cci:
  - CCI-000366
  800-53r5:
  - AC-4
  - SC-7(12)
  - CM-7
  - CM-7(1)
  - SC-7
  800-53r4:
  - AC-4
  - AC-6(1)
  - AC-19
  - SC-7
  - CM-7
  - CM-7(1)
  - SC-7(12)
  srg:
  - SRG-OS-000480-GPOS-00232
  disa_stig: |-
    $OS_VALUE
  800-171r2:
  - 3.1.3
  - 3.1.5
  - 3.1.18
  - 3.4.6
  - 3.13.1
  - 3.13.2
  - 3.13.5
  cis:
    benchmark:
    - 2.5.2.2 (level 1)
    controls v8:
    - 4.1
    - 4.5
    - 13.1
tags:
- 800-53r5_low
- 800-53r4_low
- 800-53r4_moderate
- 800-53r4_high
- 800-53r5_moderate
- 800-53r5_high
- 800-171
- cnssi-1253
- cis_lvl1
- cis_lvl2
- cisv8
- stig
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.security.firewall:
    EnableFirewall: true
OS_specifics:
  macOS:
    '12':
      references:
        cce:
        - CCE-91055-4
        disa_stig:
        - APPL-12-005050
    '11':
      references:
        cce:
        - CCE-85427-3
        disa_stig:
        - APPL-11-005050
    '10.15':
      references:
        cce:
        - CCE-84832-5
        disa_stig:
        - AOSX-15-005050
