id: sysprefs_hot_corners_disable
title: Disable Hot Corners
discussion: "Hot corners _MUST_ be disabled. \n\nThe information system conceals, via the session lock, information previously visible on the display with a publicly viewable image. Although hot comers can be used to initiate a session lock or to launch useful applications, they can also be configured to disable an automatic session lock from initiating. Such a configuration introduces the risk that a user might forget to manually lock the screen before stepping away from the computer.\n"
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -Ec '"wvous-bl-corner" = 0|"wvous-br-corner" = 0|"wvous-tl-corner" = 0|"wvous-tr-corner" = 0'
result:
  integer: 4
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-000060
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
  nist:
    800-53r5:
      - AC-11(1)
    800-53r4:
      - AC-11(1)
    800-171r2:
      - 3.1.10
  cce:
    - $OS_VALUE
tags:
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - stig
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.ManagedClient.preferences:
    com.apple.dock:
      wvous-bl-corner: 0
      wvous-br-corner: 0
      wvous-tr-corner: 0
      wvous-tl-corner: 0
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85431-5
        disa_stig:
          - APPL-11-000007
        srg:
          - SRG-OS-000031-GPOS-00012
    '12.0':
      references:
        cce:
          - CCE-91061-2
        disa_stig:
          - APPL-12-000007
        srg:
          - SRG-OS-000031-GPOS-00012
