id: sysprefs_wallet_applepay_prefpane_disable
title: Disable the System Preference Pane for Wallet and Apple Pay
discussion: "The system preference pane for Wallet and Apple Pay _MUST_ be disabled.\n\nDisabling the system preference pane prevents the users from configuring Wallet and Apple Pay. \n"
check: |
  /usr/bin/profiles show -output stdout-xml | /usr/bin/xmllint --xpath '//key[text()="DisabledPreferencePanes"]/following-sibling::*[1]' - | /usr/bin/grep -c com.apple.preferences.wallet
result: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-001774
      - CCI-000381
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    sfr:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - CM-7
      - CM-7(5)
    800-53r4:
      - CM-7
      - CM-7(5)
    800-171r2:
      - N/A
tags:
  - stig
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.systempreferences:
    DisabledPreferencePanes:
      - com.apple.preferences.wallet
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85485-1
        disa_stig:
          - APPL-11-002052
        srg:
          - SRG-OS-000095-GPOS-00049
        sfr:
          - N/A
    '12.0':
      references:
        cce:
          - CCE-91147-9
        disa_stig:
          - APPL-12-002052
        srg:
          - SRG-OS-000095-GPOS-00049
        sfr:
          - N/A
