id: sysprefs_internet_accounts_prefpane_hide
title: Hide the Internet Accounts System Preference Pane
discussion: |
  The Internet Accounts System Preference pane _MUST_ be hidden to prevent the addition of unauthorized internet accounts.

  [IMPORTANT]
  ====
  Some organizations may allow the use and configuration of the built-in Mail.app, Calendar.app, and Contacts.app for organizational communication. Information System Security Officers (ISSOs) may make the risk-based decision not to disable the Internet Accounts System Preference pane to avoid losing this functionality, but they are advised to first fully weigh the potential risks posed to their organization.
  ====
check: |
  /usr/bin/profiles show -output stdout-xml | /usr/bin/xmllint --xpath '//key[text()="HiddenPreferencePanes"]/following-sibling::*[1]' - | /usr/bin/grep -c com.apple.preferences.internetaccounts
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-001774
      - CCI-000381
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
  nist:
    800-53r5:
      - CM-7(5)
      - AC-20
    800-53r4:
      - AC-20
      - CM-7(5)
    800-171r2:
      - 3.1.20
    cce:
      - $OS_VALUE
tags:
  - stig
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.systempreferences:
    HiddenPreferencePanes:
      - com.apple.preferences.internetaccounts
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85487-7
        disa_stig:
          - APPL-11-002032
        srg:
          - SRG-OS-000095-GPOS-00049
          - SRG-OS-000370-GPOS-00155
    '12.0':
      references:
        cce:
          - CCE-91130-5
        disa_stig:
          - APPL-12-002032
        srg:
          - SRG-OS-000095-GPOS-00049
          - SRG-OS-000370-GPOS-00155
