id: sysprefs_personalized_advertising_disable
title: Disable Personalized Advertising
discussion: "Ad tracking and targeted ads _MUST_ be disabled.\n\nThe information system _MUST_ be configured to provide only essential capabilities. Disabling ad tracking ensures that applications and advertisers are unable to track users' interests and deliver targeted advertisements.  \n"
check: $OS_VALUE
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  cci:
    - N/A
  800-53r5:
    - AC-20
    - CM-7
    - CM-7(1)
    - SC-7(10)
  800-53r4:
    - AC-20
    - CM-7
    - CM-7(1)
  srg:
    - $OS_VALUE
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - 3.1.20
    - 3.4.6
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cisv8
  - cis_lvl1
  - cis_lvl2
mobileconfig: true
mobileconfig_info:
  com.apple.AdLib:
    allowApplePersonalizedAdvertising: false
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85438-0
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - 2.5.6 (level 1)
          controls v8:
            - 4.1
            - 4.8
      check: |
        /usr/bin/osascript -l JavaScript << EOS
        $.NSUserDefaults.alloc.initWithSuiteName('com.apple.AdLib')\
        .objectForKey('allowApplePersonalizedAdvertising').js
        EOS
    '12.0':
      references:
        cce:
          - CCE-91068-7
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - 2.5.6 (level 1)
          controls v8:
            - 4.1
            - 4.8
      check: |
        /usr/bin/osascript -l JavaScript << EOS
        $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
        .objectForKey('allowApplePersonalizedAdvertising').js
        EOS
