id: sysprefs_guest_access_afp_disable
title: Disable Guest Access to Shared Apple File Protocol Folders
discussion: "Guest access to shared Apple File Protocol (AFP) folders _MUST_ be disabled.\
  \ \n\nTurning off guest access prevents anonymous users from accessing files shared\
  \ via AFP.\n"
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'guestAccess = 0' | /usr/bin/awk '{ if ($1 >= 1) {print "1"} else {print "0"}}'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce: |-
    $OS_VALUE
  800-53r5:
  - AC-2(9)
  - AC-2
  800-53r4:
  - IA-2
  disa_stig: |-
    $OS_VALUE
  srg:
  - N/A
  cci:
  - N/A
  800-171r2:
  - 3.5.1
  - 3.5.2
  cis:
    benchmark:
    - N/A
    controls v8:
    - 5.2
    - 6.2
    - 6.8
tags:
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- 800-53r4_low
- 800-53r4_moderate
- 800-53r4_high
- 800-171
- cnssi-1253
- cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.AppleFileServer:
    guestAccess: false
OS_specifics:
  macOS:
    '10.15':
      references:
        cce:
        - CCE-84760-8
        disa_stig:
        - N/A
