id: os_airdrop_disable
title: Disable AirDrop
discussion: |-
  AirDrop _MUST_ be disabled to prevent file transfers to or from unauthorized devices.
  AirDrop allows users to share and receive files from other nearby Apple devices.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowAirDrop').js
  EOS
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce: |-
    $OS_VALUE
  cci:
  - CCI-000381
  800-53r5:
  - AC-3
  - AC-20
  - CM-7
  - CM-7(1)
  800-53r4:
  - CM-7
  - CM-7(1)
  - AC-3
  - AC-20
  srg:
  - SRG-OS-000095-GPOS-00049
  disa_stig: |-
    $OS_VALUE
  800-171r2:
  - 3.1.1
  - 3.1.2
  - 3.1.16
  - 3.1.20
  - 3.4.6
  cis:
    benchmark:
    - 2.4.11 (level 1)
    controls v8:
    - 4.1
    - 4.8
    - 6.7
tags:
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- 800-53r4_low
- 800-53r4_moderate
- 800-53r4_high
- 800-171
- cnssi-1253
- cis_lvl1
- cis_lvl2
- cisv8
- stig
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAirDrop: false
OS_specifics:
  macOS:
    '12':
      references:
        cce:
        - CCE-90898-8
        disa_stig:
        - APPL-12-002009
    '11':
      references:
        cce:
        - CCE-85293-9
        disa_stig:
        - APPL-11-002009
    '10.15':
      references:
        cce:
        - CCE-84747-5
        disa_stig:
        - AOSX-15-002009
