id: os_allow_documents_unmanaged_sources_managed_destinations_disable
title: Ensure Allow documents from unmanaged sources in managed destinations is set to Disabled
discussion: |
  Documents from unmanaged sources _MUST_ not be allowed in managed destinations.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  cci:
    - N/A
  800-53r5:
    - AC-3
    - AC-5
    - AC-6
    - MP-2
  sfr:
    - N/A
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - N/A
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
  800-53r4:
    - None
  srg:
    - $OS_VALUE
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
severity: ''
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowOpenFromUnmanagedToManaged: false
os_specifics:
  ios:
    '16.0':
      references:
        cce:
          - N/A
        disa_stig:
          - N/A
        srg:
          - None
        cis:
          benchmark:
            - 2.2.1.9 (level 1 - End-User Owned Devices)
            - 3.2.1.22 (level 1 - Institutionally-Owned Devices)
          controls v8:
            - 3.3
