id: os_appleid_prompt_disable
title: Disable Apple ID Setup during Setup Assistant
discussion: "The prompt for Apple ID setup during Setup Assistant _MUST_ be disabled.\
  \ \n\nmacOS will automatically prompt new users to set up an Apple ID while they\
  \ are going through Setup Assistant if this is not disabled, misleading new users\
  \ to think they need to create Apple ID accounts upon their first login.\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.SetupAssistant.managed')\
  .objectForKey('SkipCloudSetup').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce: |-
    $OS_VALUE
  cci:
  - CCI-000381
  800-53r5:
  - AC-20
  800-53r4:
  - AC-20
  srg:
  - SRG-OS-000095-GPOS-00049
  disa_stig: |-
    $OS_VALUE
  800-171r2:
  - 3.1.20
  cis:
    benchmark:
    - N/A
    controls v8:
    - 4.1
    - 4.8
tags:
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- 800-53r4_low
- 800-53r4_moderate
- 800-53r4_high
- 800-171
- cnssi-1253
- cisv8
- stig
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.SetupAssistant.managed:
    SkipCloudSetup: true
OS_specifics:
  macOS:
    '12':
      references:
        cce:
        - CCE-90902-8
        disa_stig:
        - APPL-12-002035
    '11':
      references:
        cce:
        - CCE-85296-2
        disa_stig:
        - APPL-11-002035
    '10.15':
      references:
        cce:
        - CCE-84748-3
        disa_stig:
        - AOSX-15-002035
