id: os_apple_watch_wrist_detection_enable
title: Ensure Force Apple Watch wrist detection is set to Enabled
discussion: |
  Wrist detection _MUST_ be enabled for paired Apple Watches.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  cci:
    - CCI-000381
  800-53r5:
    - AC-3
    - AC-5
    - AC-6
    - CM-7
    - MP-2
  sfr:
    - 'FMT_SMF_EXT.1.1 #47'
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - N/A
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
  800-53r4:
    - None
  srg:
    - $OS_VALUE
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - stig
severity: low
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceWatchWristDetection: true
os_specifics:
  ios:
    '16.0':
      references:
        cce:
          - N/A
        disa_stig:
          - AIOS-16-011800
        srg:
          - None
        cis:
          benchmark:
            - 2.2.1.13 (level 1 - End-User Owned Devices)
            - 3.2.1.27 (level 1 - Institutionally-Owned Devices)
          controls v8:
            - 3.3
