id: os_authentication_password_autofill_enable
title: Ensure Require Touch ID / Face ID authentication before AutoFill is set to Enabled
discussion: |
  Re-authentication _MUST_ be enabled at each Autofill operation.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  cci:
    - N/A
  800-53r5:
    - AC-3
    - AC-5
    - AC-6
    - MP-2
  srg:
    - $OS_VALUE
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - N/A
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
  800-53r4:
    - None
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
severity: ''
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceAuthenticationBeforeAutoFill: true
os_specifics:
  ios:
    '16.0':
      references:
        cce:
          - N/A
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - 3.2.1.26 (level 1 - Institutionally-Owned Devices)
          controls v8:
            - 3.3
