id: os_allow_documents_managed_sources_unmanaged_destinations_disable
title: Ensure Allow documents from managed sources in unmanaged destinations is set to Disabled
discussion: |
  Documents from managed sources _MUST_ not be allowed in unmanaged destinations.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-002233
      - CCI-002530
    sfr:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    srg:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - AC-3
      - MP-2
      - SC-7(10)
      - SC-39
    800-171r2:
      - N/A
    800-53r4:
      - None
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - 800-53r5
severity: medium
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowOpenFromManagedToUnmanaged: false
os_specifics:
  iOS:
    '16.0':
      references:
        cce:
          - N/A
        disa_stig:
          - AIOS-16-009700
        srg:
          - None
        sfr:
          - 'FMT_SMF_EXT.1.1 #42'
          - FDP_ACF_EXT.1.2
        cis:
          benchmark:
            - 2.2.1.8 (level 1 - End-User Owned Devices)
            - 3.2.1.21 (level 1 - Institutionally-Owned Devices)
          controls v8:
            - 3.3
