id: os_airdrop_disable
title: Disable AirDrop
discussion: |-
  AirDrop _MUST_ be disabled to prevent file transfers to or from unauthorized devices.
  AirDrop allows users to share and receive files from other nearby Apple devices.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowAirDrop').js
  EOS
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  cci:
    - CCI-000381
  800-53r5:
    - AC-3
    - AC-20
    - CM-7
    - CM-7(1)
  800-53r4:
    - CM-7
    - CM-7(1)
    - AC-3
    - AC-20
  srg:
    - $OS_VALUE
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - 3.1.1
    - 3.1.2
    - 3.1.16
    - 3.1.20
    - 3.4.6
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - stig
  - cisv8
  - cis_lvl1
  - cis_lvl2
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAirDrop: false
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85293-9
        disa_stig:
          - APPL-11-002009
        srg:
          - SRG-OS-000095-GPOS-00049
        cis:
          benchmark:
            - 2.4.11 (level 1)
          controls v8:
            - 4.1
            - 4.8
            - 6.7
    '12.0':
      references:
        cce:
          - CCE-90898-8
        disa_stig:
          - APPL-12-002009
        srg:
          - SRG-OS-000095-GPOS-00049
        cis:
          benchmark:
            - 2.4.11 (level 1)
          controls v8:
            - 4.1
            - 4.8
            - 6.7
    '13.0':
      references:
        cce:
          - CCE-91754-2
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - 2.3.1.1 (level 1)
          controls v8:
            - 4.1
            - 4.8
            - 6.7
