id: os_airdrop_unmanaged_destination_enable
title: Ensure Treat AirDrop as unmanaged destination is set to Enabled
discussion: |
  AirDrop _MUST_ be treated as an unmanaged destination.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  cci:
    - CCI-000366
    - CCI-002008
  800-53r5:
    - AC-3
    - AC-5
    - AC-6
    - MP-2
  sfr:
    - 'FMT_SMF_EXT.1.1 #47'
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - N/A
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
  800-53r4:
    - None
  srg:
    - $OS_VALUE
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
severity: ''
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceAirDropUnmanaged: true
os_specifics:
  ios:
    '16.0':
      references:
        cce:
          - N/A
        disa_stig:
          - AIOS-16-011500
        srg:
          - None
        cis:
          benchmark:
            - 2.2.1.10 (level 1 - End-User Owned Devices)
            - 3.2.1.23 (level 1 - Institutionally-Owned Devices)
          controls v8:
            - 3.3
