id: os_bonjour_disable
title: Disable Bonjour Multicast
discussion: |
  Bonjour multicast advertising _MUST_ be disabled to prevent the system from broadcasting its presence and available services over network interfaces.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.mDNSResponder')\
  .objectForKey('NoMulticastAdvertisements').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  cci:
    - CCI-000381
  800-53r5:
    - CM-7
    - CM-7(1)
  800-53r4:
    - CM-7
    - CM-7(1)
  srg:
    - $OS_VALUE
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - 3.4.6
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - stig
  - cisv8
  - cis_lvl2
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.mDNSResponder:
    NoMulticastAdvertisements: true
os_specifics:
  '11.0':
    references:
      cce:
        - CCE-85299-6
      disa_stig:
        - APPL-11-002005
      srg:
        - SRG-OS-000095-GPOS-00049
      cis:
        benchmark:
          - 4.1 (level 2)
        controls v8:
          - 4.1
          - 4.8
  '12.0':
    references:
      cce:
        - CCE-90908-5
      disa_stig:
        - APPL-12-002005
      srg:
        - SRG-OS-000095-GPOS-00049
      cis:
        benchmark:
          - 4.1 (level 2)
        controls v8:
          - 4.1
          - 4.8
  '13.0':
    references:
      cce:
        - CCE-91767-4
      disa_stig:
        - N/A
      srg:
        - N/A
      cis:
        benchmark:
          - 4.1 (level 2)
        controls v8:
          - 4.1
          - 4.8
