id: os_burn_support_disable
title: Disable Burn Support
discussion: |
  Burn support _MUST_ be disabled.

  [IMPORTANT]
  ====
  Some organizations rely on the use of removable media for storing and sharing data. Information System Security Officers (ISSOs) may make the risk-based decision not to disable external hard drives to avoid losing this functionality, but they are advised to first fully weigh the potential risks posed to their organization.
  ====
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -Ec '(BurnSupport = off;|ProhibitBurn = 1;)'
result: 2
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    cci:
      - None
    sfr:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - MP-7
    800-53r4:
      - MP-7(1)
tags:
  - none
  - stig
severity: low
mobileconfig: true
mobileconfig_info:
  com.apple.finder:
    ProhibitBurn: true
  com.apple.DiscRecording:
    BurnSupport: 'off'
os_specifics:
  macOS:
    '11.0':
      references:
        disa:
          disa_stig:
            - APPL-12-005053
          srg:
            - SRG-OS-000480-GPOS-00227
          sfr:
            - N/A
        nist:
          cce:
            - CCE-85544-5
    '12.0':
      references:
        disa:
          disa_stig:
            - APPL-12-005053
          srg:
            - SRG-OS-000480-GPOS-00227
          sfr:
            - N/A
        nist:
          cce:
            - CCE-91098-4
    '13.0':
      references:
        disa:
          disa_stig:
            - N/A
          srg:
            - N/A
          sfr:
            - N/A
        nist:
          cce:
            - CCE-91768-2
