id: os_config_data_install_enforce
title: Enforce Installation of XProtect, MRT, and Gatekeeper Updates Automatically
discussion: |
  Software Update _MUST_ be configured to update XProtect, MRT, and Gatekeepr automatically.

  This setting enforces definition updates for XProtect, MRT, and Gatekeeper; with this setting in place, new malware and adware that Apple has added to the list of malware or untrusted software will not execute. These updates do not require the computer to be restarted.

  link:https://support.apple.com/en-us/HT207005[]

  NOTE: Software update will automatically update XProtect, MRT, and Gatekeeper by default in the macOS.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.SoftwareUpdate')\
  .objectForKey('ConfigDataInstall').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce: |-
    $OS_VALUE
  cci:
  - CCI-000366
  800-53r5:
  - SI-3
  - SI-2(5)
  800-53r4:
  - N/A
  srg:
  - SRG-OS-000480-GPOS-00227
  disa_stig: |-
    $OS_VALUE
  800-171r2:
  - N/A
  cis:
    benchmark:
    - 1.5 (level 1)
    controls v8:
    - 10.1
    - 10.2
    - 10.4
tags:
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- cis_lvl1
- cis_lvl2
- cisv8
- stig
severity: high
mobileconfig: true
mobileconfig_info:
  com.apple.SoftwareUpdate:
    ConfigDataInstall: true
OS_specifics:
  macOS:
    '12':
      references:
        cce:
        - CCE-90913-5
        disa_stig:
        - APPL-12-002070
    '11':
      references:
        cce:
        - CCE-85466-1
        disa_stig:
        - N/A
    '10.15':
      references:
        cce:
        - CCE-84929-9
        disa_stig:
        - N/A
