id: os_camera_disable
title: Disable Camera
discussion: |
  macOS _MUST_ be configured to disable the camera.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowCamera').js
  EOS
result: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-000381
      - CCI-001150
      - CCI-001153
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    sfr:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - N/A
    800-53r4:
      - N/A
tags:
  - none
  - stig
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowCamera: false
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85301-0
        disa_stig:
          - APPL-11-002017
        srg:
          - SRG-OS-000095-GPOS-00049
          - SRG-OS-000370-GPOS-00155
        sfr:
          - N/A
    '10.15':
      references:
        cce:
          - CCE-84751-7
        disa_stig:
          - AOSX-15-002017
        srg:
          - SRG-OS-000095-GPOS-00049
          - SRG-OS-000370-GPOS-00155
        sfr:
          - N/A
    '12.0':
      references:
        cce:
          - CCE-90910-1
        disa_stig:
          - APPL-12-002017
        srg:
          - SRG-OS-000095-GPOS-00049
          - SRG-OS-000370-GPOS-00155
        sfr:
          - N/A
    '13.0':
      references:
        cce:
          - CCE-91770-8
        disa_stig:
          - N/A
        srg:
          - N/A
        sfr:
          - N/A
