id: os_firewall_log_enable
title: Enable Firewall Logging
discussion: "Firewall logging _MUST_ be enabled. \n\nFirewall logging ensures that\
  \ malicious network activity will be logged to the system. \n\nNOTE: The firewall\
  \ data is logged to Apple's Unified Logging with the subsystem `com.apple.alf` and\
  \ the data is marked as private. In order to enable private data, review the `com.apple.alf.private_data.mobileconfig`\
  \ file in the project's `includes` folder. \n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  function run() {
    let pref1 = $.NSUserDefaults.alloc.initWithSuiteName('com.apple.security.firewall')\
    .objectForKey('EnableLogging').js
    let pref2 = $.NSUserDefaults.alloc.initWithSuiteName('com.apple.security.firewall')\
    .objectForKey('LoggingOption').js
    if ( pref1 == true && pref2 == "detail" ){
      return("true")
    } else {
      return("false")
    }
  }
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce: |-
    $OS_VALUE
  cci:
  - N/A
  800-53r5:
  - AU-12
  - SC-7
  800-53r4:
  - SC-7
  - AU-12
  srg:
  - N/A
  disa_stig: |-
    $OS_VALUE
  800-171r2:
  - 3.3.1
  - 3.3.2
  - 3.13.1
  - 3.13.2
  - 3.13.5
  cis:
    benchmark:
    - 3.6 (level 1)
    controls v8:
    - 4.5
    - 8.2
    - 8.5
tags:
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- 800-53r4_low
- 800-53r4_moderate
- 800-53r4_high
- 800-171
- cnssi-1253
- cis_lvl1
- cis_lvl2
- cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.security.firewall:
    EnableLogging: true
    LoggingOption: detail
OS_specifics:
  macOS:
    '12':
      references:
        cce:
        - CCE-90924-2
        disa_stig:
        - N/A
    '11':
      references:
        cce:
        - CCE-85313-5
        disa_stig:
        - N/A
    '10.15':
      references:
        cce:
        - CCE-84757-4
        disa_stig:
        - N/A
