id: os_files_usb_drive_access_disable
title: Ensure Allow USB drive access in Files app is set to Disabled
discussion: |
  USB drive acces in Files app _MUST_ be disabled.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-000366
      - CCI-000097
      - CCI-000370
    sfr:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    srg:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - AC-20(2)
    800-53r4:
      - N/A
    800-171r2:
      - N/A
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - ios
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl2_enterprise
  - cisv8
  - stig
severity: medium
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowFilesUSBDriveAccess: false
os_specifics:
  iOS:
    '16.0':
      references:
        disa:
          disa_stig:
            - AIOS-16-013300
          srg:
            - None
          sfr:
            - 'FMT_SMF_EXT.1.1 #47'
        nist:
          cce:
            - N/A
        cis:
          benchmark:
            - 3.2.1.8 (level 2 - Institutionally-Owned Devices)
          controls v8:
            - 1.2
