id: os_filevault_autologin_disable
title: Disable FileVault Automatic Login
discussion: "If FileVault is enabled, automatic login _MUST_ be disabled, so that both FileVault and login window authentication are required.\n\nThe default behavior of macOS when FileVault is enabled is to automatically log in to the computer once successfully passing your FileVault credentials. \n\nNOTE: DisableFDEAutoLogin does not have to be set on Apple Silicon based macOS systems that are smartcard enforced as smartcards are available at pre-boot.\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.loginwindow')\
  .objectForKey('DisableFDEAutoLogin').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    cci:
      - CCI-002143
  nist:
    800-53r5:
      - AC-3
      - IA-5(13)
      - AC-2(11)
    800-53r4:
      - AC-2(11)
      - AC-3
      - IA-5(13)
    800-171r2:
      - 3.1.1
      - 3.1.2
  cce:
    - $OS_VALUE
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - stig
  - cisv8
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.loginwindow:
    DisableFDEAutoLogin: true
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85310-1
        disa_stig:
          - APPL-11-000033
        srg:
          - SRG-OS-000480-GPOS-00227
        cis:
          benchmark:
            - N/A
          controls v8:
            - 3.3
            - 6.7
    '12.0':
      references:
        cce:
          - CCE-90922-6
        disa_stig:
          - APPL-12-000033
        srg:
          - SRG-OS-000480-GPOS-00227
        cis:
          benchmark:
            - N/A
          controls v8:
            - 3.3
            - 6.7
    '13.0':
      references:
        cce:
          - CCE-91789-8
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - N/A
          controls v8:
            - 3.3
            - 6.7
