id: os_force_encrypted_backups_enable
title: Ensure Force Encrypted Backups is Enabled
discussion: |
  iOS and iPadOS backups _MUST_ be encrypted.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-000366
      - CCI-000370
      - CCI-000381
    sfr:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    srg:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - CM-7
      - CM-7(1)
      - CP-09(8)
      - SC-28
    800-171r2:
      - N/A
    800-53r4:
      - None
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - stig
severity: medium
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    forceEncryptedBackup: true
os_specifics:
  iOS:
    '16.0':
      references:
        cce:
          - N/A
        disa_stig:
          - AIOS-16-010700
        srg:
          - None
        sfr:
          - 'FMT_SMF_EXT.1.1 #47'
        cis:
          benchmark:
            - 2.2.1.4 (level 1 - End-User Owned Devices)
            - 3.2.1.10 (level 1 - Institutionally-Owned Devices)
          controls v8:
            - 11.3
