id: os_gatekeeper_rearm
title: Enforce Gatekeeper 30 Day Automatic Rearm
discussion: |
  Gatekeeper _MUST_ be configured to automatically rearm after 30 days if disabled.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.security')\
  .objectForKey('GKAutoRearm').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - N/A
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
  nist:
    800-53r5:
      - CM-5
    800-53r4:
      - CM-5
      - SI-3
    800-171r2:
      - 3.4.5
  cce:
    - $OS_VALUE
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.ManagedClient.preferences:
    com.apple.security:
      GKAutoRearm: true
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85316-8
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - N/A
          controls v8:
            - 10.5
    '12.0':
      references:
        cce:
          - CCE-90927-5
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - N/A
          controls v8:
            - 10.5
    '13.0':
      references:
        cce:
          - CCE-91794-8
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - N/A
          controls v8:
            - 10.5
