id: os_handoff_disable
title: Disable Handoff
discussion: "Handoff _MUST_ be disabled. \n\nHandoff allows you to continue working on a document or project when the user switches from one Apple device to another. Disabling Handoff prevents data transfers to unauthorized devices.\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowActivityContinuation').js
  EOS
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    disa_stig:
      - $OS_VALUE
    srg:
      - $OS_VALUE
    cci:
      - N/A
  nist:
    800-53r5:
      - AC-3
      - AC-20
      - CM-7
      - CM-7(1)
    800-53r4:
      - AC-3
      - AC-20
      - CM-7
      - CM-7(1)
    800-171r2:
      - 3.1.1
      - 3.1.2
      - 3.1.20
      - 3.4.6
    cce:
      - $OS_VALUE
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowActivityContinuation: false
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85321-8
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.1
            - 4.8
    '12.0':
      references:
        cce:
          - CCE-90929-1
        disa_stig:
          - APPL-12-005058
        srg:
          - SRG-OS-000095-GPOS-00049
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.1
            - 4.8
    '13.0':
      references:
        cce:
          - CCE-91797-1
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.1
            - 4.8
