id: os_hibernate_mode_destroyfvkeyonstandby_enable
title: Enable DestroyFVKeyOnStandby on Hibernate
discussion: "DestroyFVKeyOnStandby on hibernate _MUST_ be enabled. \n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.MCX')\
  .objectForKey('DestroyFVKeyOnStandby').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  800-53r5:
    - N/A
  800-53r4:
    - N/A
  srg:
    - $OS_VALUE
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - N/A
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
  cci:
    - None
tags:
  - cis_lvl2
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.MCX:
    DestroyFVKeyOnStandby: true
os_specifics:
  '11.0':
    references:
      cce:
        - CCE-85504-9
      disa_stig:
        - N/A
      srg:
        - N/A
      cis:
        benchmark:
          - 2.8.3  (level 2)
        controls v8:
          - 4.1
  '12.0':
    references:
      cce:
        - CCE-91105-7
      disa_stig:
        - N/A
      srg:
        - N/A
      cis:
        benchmark:
          - 2.8.3 (level 2)
        controls v8:
          - 4.1
  '13.0':
    references:
      cce:
        - CCE-91798-9
      disa_stig:
        - N/A
      srg:
        - N/A
      cis:
        benchmark:
          - 2.9.3 (level 2)
        controls v8:
          - 4.1
