id: os_internet_accounts_prefpane_disable
title: Disable the Internet Accounts System Preference Pane
discussion: |
  The Internet Accounts System Preference pane _MUST_ be disabled to prevent the addition of unauthorized internet accounts.

  [IMPORTANT]
  ====
  Some organizations may allow the use and configuration of the built-in Mail.app, Calendar.app, and Contacts.app for organizational communication. Information System Security Officers (ISSOs) may make the risk-based decision not to disable the Internet Accounts System Preference pane to avoid losing this functionality, but they are advised to first fully weigh the potential risks posed to their organization.
  ====
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'com.apple.preferences.internetaccounts' | /usr/bin/awk '{ if ($1 >= 1) {print "1"} else {print "0"}}'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce: |-
    $OS_VALUE
  cci:
  - CCI-000381
  - CCI-001774
  800-53r5:
  - CM-7(5)
  - AC-20
  800-53r4:
  - AC-20
  srg:
  - SRG-OS-000095-GPOS-00049
  - SRG-OS-000370-GPOS-00155
  disa_stig: |-
    $OS_VALUE
  800-171r2:
  - 3.1.20
  cis:
    benchmark:
    - N/A
    controls v8:
    - 4.8
    - 15.2
tags:
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- 800-171
- cnssi-1253
- 800-53r4_low
- 800-53r4_moderate
- 800-53r4_high
- stig
- cisv8
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.systempreferences:
    DisabledPreferencePanes:
    - com.apple.preferences.internetaccounts
OS_specifics:
  macOS:
    '10.15':
      references:
        cce:
        - CCE-84767-3
        disa_stig:
        - AOSX-15-002032
