id: os_messages_app_disable
title: Disable Messages App
discussion: "The macOS built-in Messages.app _MUST_ be disabled. \n\nThe Messages.app\
  \ establishes a connection to Apple's iCloud service, even when security controls\
  \ to disable iCloud access have been put in place. \n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  function run() {
    let pref1 = ObjC.unwrap($.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess.new')\
    .objectForKey('familyControlsEnabled'))
    let pathlist = $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess.new')\
    .objectForKey('pathBlackList').js
    for ( let app in pathlist ) {
        if ( ObjC.unwrap(pathlist[app]) == "/Applications/Messages.app" && pref1 == true ){
            return("true")
        }
    }
    return("false")
    }
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce: |-
    $OS_VALUE
  cci:
  - CCI-000381
  - CCI-001774
  800-53r5:
  - AC-20
  - CM-7
  - CM-7(1)
  800-53r4:
  - CM-7
  - CM-7(1)
  - AC-20
  srg:
  - N/A
  disa_stig: |-
    $OS_VALUE
  800-171r2:
  - 3.1.20
  - 3.4.6
  cis:
    benchmark:
    - N/A
    controls v8:
    - 4.1
    - 4.8
tags:
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- 800-53r4_low
- 800-53r4_moderate
- 800-53r4_high
- 800-171
- cnssi-1253
- cisv8
severity: low
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess.new:
    familyControlsEnabled: true
    pathBlackList:
    - /Applications/Messages.app
OS_specifics:
  macOS:
    '12':
      references:
        cce:
        - CCE-90951-5
        disa_stig:
        - N/A
    '11':
      references:
        cce:
        - CCE-85339-0
        disa_stig:
        - N/A
    '10.15':
      references:
        cce:
        - CCE-84770-7
        disa_stig:
        - AOSX-15-002011
