id: os_mail_maildrop_disable
title: Ensure Allow Mail Drop is set to Disabled
discussion: |
  Mail Drop _MUST_ be disabled.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-000366
      - CCI-000370
      - CCI-002314
    sfr:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    srg:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - AC-3
      - AC-20
      - CM-7
      - CM-7(1)
      - SC-07(10)
    800-171r2:
      - N/A
    800-53r4:
      - None
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl2_byod
  - cis_lvl2_enterprise
  - cisv8
  - stig
severity: medium
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.mail.managed:
    allowMailDrop: false
os_specifics:
  iOS:
    '16.0':
      references:
        disa:
          disa_stig:
            - AIOS-16-011000
          srg:
            - None
          sfr:
            - 'FMT_SMF_EXT.1.1 #47'
        nist:
          cce:
            - N/A
        cis:
          benchmark:
            - 2.7.2 (level 2 - End-User Owned Devices)
            - 3.7.2 (level 2 - Institutionally-Owned Devices)
          controls v8:
            - 3.3
