id: os_mail_app_disable
title: Disable Mail App
discussion: "The macOS built-in Mail.app _MUST_ be disabled. \n\nThe Mail.app contains\
  \ functionality that can establish connections to Apple's iCloud, even when security\
  \ controls to disable iCloud access have been put in place.\n\n[IMPORTANT]\n====\n\
  Some organizations allow the use of the built-in Mail.app for organizational communication.\
  \ Information System Security Officers (ISSOs) may make the risk-based decision\
  \ not to disable the macOS built-in Mail.app to avoid losing this functionality,\
  \ but they are advised to first fully weigh the potential risks posed to their organization.\n\
  ====\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  function run() {
    let pref1 = ObjC.unwrap($.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess.new')\
    .objectForKey('familyControlsEnabled'))
    let pathlist = $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess.new')\
    .objectForKey('pathBlackList').js
    for ( let app in pathlist ) {
        if ( ObjC.unwrap(pathlist[app]) == "/Applications/Mail.app" && pref1 == true ){
            return("true")
        }
    }
    return("false")
    }
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce: |-
    $OS_VALUE
  cci:
  - CCI-000381
  800-53r5:
  - AC-20
  - CM-7
  - CM-7(1)
  800-53r4:
  - CM-7
  - CM-7(1)
  - AC-20
  srg:
  - N/A
  disa_stig: |-
    $OS_VALUE
  800-171r2:
  - 3.1.20
  - 3.4.6
  cis:
    benchmark:
    - N/A
    controls v8:
    - 4.1
    - 4.8
tags:
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- 800-53r4_low
- 800-53r4_moderate
- 800-53r4_high
- 800-171
- cnssi-1253
- cisv8
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess.new:
    familyControlsEnabled: true
    pathBlackList:
    - /Applications/Mail.app
OS_specifics:
  macOS:
    '12':
      references:
        cce:
        - CCE-90946-5
        disa_stig:
        - N/A
    '11':
      references:
        cce:
        - CCE-85336-6
        disa_stig:
        - N/A
    '10.15':
      references:
        cce:
        - CCE-84769-9
        disa_stig:
        - AOSX-15-002019
