id: os_mail_maildrop_disable
title: Ensure Allow Mail Drop is set to Disabled
discussion: |
  Mail Drop _MUST_ be disabled.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  cci:
    - N/A
  800-53r5:
    - AC-3
    - AC-5
    - AC-6
    - MP-2
  800-53r4:
    - N/A
  srg:
    - $OS_VALUE
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - N/A
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - ios
  - cis_lvl2_byod
  - cis_lvl2_enterprise
  - cisv8
  - 800-53r5
severity: ''
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.mail.managed:
    allowMailDrop: false
os_specifics:
  ios:
    '16.0':
      references:
        cce:
          - N/A
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - 2.7.2 (level 2 - End-User Owned Devices)
            - 3.7.2 (level 2 - Institutionally-Owned Devices)
          controls v8:
            - 3.3
