id: os_modify_cellular_data_app_settings_disable
title: Ensure Allow modifying cellular data app settings is set to Disabled
discussion: |
  The ability to modify cellular data app settings _MUST_ be disabled.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  cci:
    - N/A
  800-53r5:
    - CM-1
    - CM-2
    - CM-6
    - CM-7
    - CM-7(1)
    - CM-9
    - SA-3
    - SA-8
    - SA-10
  800-53r4:
    - N/A
  srg:
    - $OS_VALUE
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - N/A
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - ios
  - cis_lvl2_enterprise
  - cisv8
  - 800-53r5
severity: ''
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowAppCellularDataModification: false
os_specifics:
  ios:
    '16.0':
      references:
        cce:
          - N/A
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - 3.2.1.18 (level 2 - Institutionally-Owned Devices)
          controls v8:
            - 4.1
