id: os_mail_app_disable
title: Disable Mail App
discussion: "The macOS built-in Mail.app _MUST_ be disabled. \n\nThe Mail.app contains functionality that can establish connections to Apple's iCloud, even when security controls to disable iCloud access have been put in place.\n\n[IMPORTANT]\n====\nSome organizations allow the use of the built-in Mail.app for organizational communication. Information System Security Officers (ISSOs) may make the risk-based decision not to disable the macOS built-in Mail.app to avoid losing this functionality, but they are advised to first fully weigh the potential risks posed to their organization.\n====\n\n[IMPORTANT]\n====\nApple has deprecated the use of link:https://github.com/apple/device-management/blob/eb51fb0cb9626cac4717858556912c257a734ce0/mdm/profiles/com.apple.applicationaccess.new.yaml#L67-L70[application restriction controls], using these controls may not work as expected. Third party software may be required to fulfill the compliance requirements.\n====\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  function run() {
    let pref1 = ObjC.unwrap($.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess.new')\
    .objectForKey('familyControlsEnabled'))
    let pathlist = $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess.new')\
    .objectForKey('pathBlackList').js
    for ( let app in pathlist ) {
        if ( ObjC.unwrap(pathlist[app]) == "/Applications/Mail.app" && pref1 == true ){
            return("true")
        }
    }
    return("false")
    }
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  cci:
    - N/A
  800-53r5:
    - AC-20
    - CM-7
    - CM-7(1)
  800-53r4:
    - CM-7
    - CM-7(1)
    - AC-20
  srg:
    - $OS_VALUE
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - 3.1.20
    - 3.4.6
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - none
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess.new:
    familyControlsEnabled: true
    pathBlackList:
      - /Applications/Mail.app
os_specifics:
  '11.0':
    references:
      cce:
        - CCE-85336-6
      disa_stig:
        - N/A
      srg:
        - N/A
      cis:
        benchmark:
          - N/A
        controls v8:
          - 4.1
          - 4.8
  '12.0':
    references:
      cce:
        - CCE-90946-5
      disa_stig:
        - N/A
      srg:
        - N/A
      cis:
        benchmark:
          - N/A
        controls v8:
          - 4.1
          - 4.8
  '13.0':
    references:
      cce:
        - CCE-91816-9
      disa_stig:
        - N/A
      srg:
        - N/A
      cis:
        benchmark:
          - N/A
        controls v8:
          - 4.1
          - 4.8
