id: os_password_proximity_disable
title: Disable Proximity Based Password Sharing Requests
discussion: "Proximity based password sharing requests _MUST_ be disabled. \n\nThe default behavior of macOS is to allow users to request passwords from other known devices (macOS and iOS). This feature _MUST_ be disabled to prevent passwords from being shared.\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowPasswordProximityRequests').js
  EOS
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  cci:
    - N/A
  800-53r5:
    - IA-5
  800-53r4:
    - IA-5
  srg:
    - $OS_VALUE
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - 3.5.1
    - 3.5.2
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowPasswordProximityRequests: false
os_specifics:
  '11.0':
    references:
      cce:
        - CCE-85352-3
      disa_stig:
        - N/A
      srg:
        - N/A
      cis:
        benchmark:
          - N/A
        controls v8:
          - 4.1
          - 4.8
  '12.0':
    references:
      cce:
        - CCE-90968-9
      disa_stig:
        - APPL-12-005060
      srg:
        - SRG-OS-000095-GPOS-00049
      cis:
        benchmark:
          - N/A
        controls v8:
          - 4.1
          - 4.8
  '13.0':
    references:
      cce:
        - CCE-91840-9
      disa_stig:
        - N/A
      srg:
        - N/A
      cis:
        benchmark:
          - N/A
        controls v8:
          - 4.1
          - 4.8
