id: os_password_sharing_disable
title: Disable Password Sharing
discussion: "Password Sharing _MUST_ be disabled. \n\nThe default behavior of macOS\
  \ is to allow users to share a password over Airdrop between other macOS and iOS\
  \ devices. This feature _MUST_ be disabled to prevent passwords from being shared.\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowPasswordSharing').js
  EOS
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce: |-
    $OS_VALUE
  800-53r5:
  - IA-5
  800-53r4:
  - IA-5
  srg:
  - N/A
  disa_stig: |-
    $OS_VALUE
  800-171r2:
  - 3.5.1
  - 3.5.2
  cis:
    benchmark:
    - N/A
    controls v8:
    - 4.1
    - 4.8
tags:
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- 800-53r4_low
- 800-53r4_moderate
- 800-53r4_high
- 800-171
- cnssi-1253
- cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowPasswordSharing: false
OS_specifics:
  macOS:
    '12':
      references:
        cce:
        - CCE-90969-7
        disa_stig:
        - N/A
    '11':
      references:
        cce:
        - CCE-85353-1
        disa_stig:
        - N/A
    '10.15':
      references:
        cce:
        - CCE-84776-4
        disa_stig:
        - N/A
