id: os_password_proximity_disable
title: Disable Proximity Based Password Sharing Requests
discussion: "Proximity based password sharing requests _MUST_ be disabled. \n\nThe default behavior of macOS is to allow users to request passwords from other known devices (macOS and iOS). This feature _MUST_ be disabled to prevent passwords from being shared.\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowPasswordProximityRequests').js
  EOS
result: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - N/A
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    sfr:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - IA-5
    800-53r4:
      - IA-5
    800-171r2:
      - 3.5.1
      - 3.5.2
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cisv8
  - cis_lvl2_enterprise
  - ios
  - cis_lvl1_enterprise
  - stig
  - cnssi-1253
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowPasswordProximityRequests: false
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85352-3
        disa_stig:
          - N/A
        srg:
          - N/A
        sfr:
          - N/A
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.1
            - 4.8
    '10.15':
      references:
        cce:
          - CCE-84775-6
        disa_stig:
          - N/A
        srg:
          - N/A
        sfr:
          - N/A
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.1
            - 4.8
    '12.0':
      references:
        cce:
          - CCE-90968-9
        disa_stig:
          - APPL-12-005060
        srg:
          - SRG-OS-000095-GPOS-00049
        sfr:
          - N/A
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.1
            - 4.8
    '13.0':
      references:
        cce:
          - CCE-91840-9
        disa_stig:
          - N/A
        srg:
          - N/A
        sfr:
          - N/A
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.1
            - 4.8
  iOS:
    '16.0':
      references:
        cce:
          - N/A
        disa_stig:
          - AIOS-16-012900
        srg:
          - None
        sfr:
          - 'FMT_SMF_EXT.1.1 #47'
        cis:
          benchmark:
            - 3.2.1.29 (level 1 - Institutionally-Owned Devices)
          controls v8:
            - 13.5
