id: os_password_proximity_disable
title: Disable Proximity Based Password Sharing Requests
discussion: "Proximity based password sharing requests _MUST_ be disabled. \n\nThe\
  \ default behavior of macOS is to allow users to request passwords from other known\
  \ devices (macOS and iOS). This feature _MUST_ be disabled to prevent passwords\
  \ from being shared.\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowPasswordProximityRequests').js
  EOS
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce: |-
    $OS_VALUE
  cci:
  - CCI-000381
  800-53r5:
  - IA-5
  800-53r4:
  - IA-5
  srg:
  - SRG-OS-000095-GPOS-00049
  disa_stig: |-
    $OS_VALUE
  800-171r2:
  - 3.5.1
  - 3.5.2
  cis:
    benchmark:
    - N/A
    controls v8:
    - 4.1
    - 4.8
tags:
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- 800-53r4_low
- 800-53r4_moderate
- 800-53r4_high
- 800-171
- cnssi-1253
- cisv8
- stig
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowPasswordProximityRequests: false
OS_specifics:
  macOS:
    '12':
      references:
        cce:
        - CCE-90968-9
        disa_stig:
        - APPL-12-005060
    '11':
      references:
        cce:
        - CCE-85352-3
        disa_stig:
        - N/A
    '10.15':
      references:
        cce:
        - CCE-84775-6
        disa_stig:
        - N/A
