id: os_password_autofill_disable
title: Disable Password Autofill
discussion: "Password Autofill _MUST_ be disabled. \n\nmacOS allows users to save passwords and use the Password Autofill feature in Safari and compatible apps. To protect against malicious users gaining access to the system, this feature _MUST_ be disabled to prevent users from being prompted to save passwords in applications.\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowPasswordAutoFill').js
  EOS
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    disa_stig:
      - $OS_VALUE
    srg:
      - $OS_VALUE
    cci:
      - N/A
  nist:
    800-53r5:
      - IA-5(13)
      - CM-7
      - CM-7(1)
      - IA-11
      - IA-5
    800-53r4:
      - IA-5
      - IA-5(13)
      - IA-11
      - CM-7
      - CM-7(1)
    800-171r2:
      - 3.4.6
      - 3.5.1
      - 3.5.2
    cce:
      - $OS_VALUE
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowPasswordAutoFill: false
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85351-5
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.1
            - 4.8
    '12.0':
      references:
        cce:
          - CCE-90967-1
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.1
            - 4.8
    '13.0':
      references:
        cce:
          - CCE-91838-3
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.1
            - 4.8
