id: os_rapid_security_response_allow
title: Enforce Rapid Security Response Mechanism
discussion: |
  Rapid security response mechanism _MUST_ be enabled.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowRapidSecurityResponseInstallation').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  cci:
    - N/A
  800-53r5:
    - SI-2
    - SI-2(5)
    - SI-3
  srg:
    - $OS_VALUE
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - 3.14.1
    - 3.14.2
    - 3.13.3
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
  800-53r4:
    - None
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-171
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowRapidSecurityResponseInstallation: true
os_specifics:
  '13.0':
    references:
      cce:
        - CCE-91860-7
      disa_stig:
        - N/A
      srg:
        - N/A
      cis:
        benchmark:
          - N/A
        controls v8:
          - N/A
