id: os_safari_show_full_website_address_enable
title: Ensure Show Full Website Address in Safari Is Enabled
discussion: "Show full website address _MUST_ be enabled in Safari. \n"
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'ShowFullURLInSmartSearchField = 1' | /usr/bin/awk '{ if ($1 >= 1) {print "1"} else {print "0"}}'
result: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - N/A
    disa_stig:
      - $OS_VALUE
    srg:
      - $OS_VALUE
    sfr:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - N/A
    800-53r4:
      - N/A
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - cis_lvl1
  - cis_lvl2
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.Safari:
    ShowFullURLInSmartSearchField: true
os_specifics:
  macOS:
    '12.0':
      references:
        disa:
          disa_stig:
            - N/A
          srg:
            - N/A
          sfr:
            - N/A
        nist:
          cce:
            - N/A
        cis:
          benchmark:
            - 7.2.8 (level 1)
          controls v8:
            - 9.1
    '13.0':
      references:
        disa:
          disa_stig:
            - N/A
          srg:
            - N/A
          sfr:
            - N/A
        nist:
          cce:
            - CCE-92004-1
        cis:
          benchmark:
            - 6.3.7 (level 1)
          controls v8:
            - 9.1
