id: os_screensaver_timeout_loginwindow_enforce
title: Enforce Screen Saver Timeout at LoginWindow
discussion: |
  The screen saver timeout at LoginWindow _MUST_ be set to $ODV seconds or a shorter length of time.

  This rule ensures that a full session lock is triggered within no more than $ODV seconds of inactivity.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  function run() {
    let timeout = ObjC.unwrap($.NSUserDefaults.alloc.initWithSuiteName('com.apple.screensaver')\
  .objectForKey('loginWindowIdleTime'))
    if ( timeout <= $ODV ) {
      return("true")
    } else {
      return("false")
    }
  }
  EOS
result: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-000057
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    sfr:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - AC-11
      - IA-11
    800-171r2:
      - 3.1.10
    800-53r4:
      - None
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
odv:
  hint: Number of seconds.
  recommended: 1200
  stig: 900
tags:
  - stig
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.screensaver:
    loginWindowIdleTime: $ODV
os_specifics:
  macOS:
    '13.0':
      references:
        cce:
          - N/A
        disa_stig:
          - APPL-13-000004
        srg:
          - SRG-OS-000029-GPOS-00010
        sfr:
          - N/A
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.3
