id: os_safari_open_safe_downloads_disable
title: Disable Automatic Opening of Safe Files in Safari
discussion: "Open \"safe\" files after downloading _MUST_ be disabled in Safari. \n"
check: |
  /usr/bin/profiles -P -o stdout | /usr/bin/grep -c 'AutoOpenSafeDownloads = 0' | /usr/bin/awk '{ if ($1 >= 1) {print "1"} else {print "0"}}'
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    disa_stig:
      - $OS_VALUE
    srg:
      - $OS_VALUE
    cci:
      - None
  nist:
    800-53r5:
      - N/A
    800-53r4:
      - N/A
  cce:
    - $OS_VALUE
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - cis_lvl1
  - cis_lvl2
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.Safari:
    AutoOpenSafeDownloads: false
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85510-6
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - 6.3 (level 1)
          controls v8:
            - 9
    '12.0':
      references:
        cce:
          - CCE-91111-5
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - 7.2.1 (level 1)
          controls v8:
            - 9.1
            - 9.6
    '13.0':
      references:
        cce:
          - CCE-91871-4
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - 6.3.1 (level 1)
          controls v8:
            - 9.1
            - 9.6
