id: os_show_notification_center_lock_screen_disable
title: Ensure Show Notification Center in Lock screen is set to Disabled
discussion: |
  Notification Center _MUST_ be disabled in the lock screen.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-000060
    sfr:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    srg:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - AC-11(1)
    800-171r2:
      - N/A
    800-53r4:
      - None
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - ios
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - stig
severity: medium
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowLockScreenNotificationsView: false
os_specifics:
  iOS:
    '16.0':
      references:
        disa:
          disa_stig:
            - AIOS-16-007500
          srg:
            - None
          sfr:
            - 'FMT_SMF_EXT.1.1 #18'
        nist:
          cce:
            - N/A
        cis:
          benchmark:
            - 2.2.1.15 (level 1 - End-User Owned Devices)
            - 3.2.1.32 (level 1 - Institutionally-Owned Devices)
          controls v8:
            - 4.3
