id: os_siri_prompt_disable
title: Disable Siri Setup during Setup Assistant
discussion: |
  The prompt for Siri during Setup Assistant _MUST_ be disabled.

  Organizations _MUST_ apply organization-wide configuration settings. The macOS Siri Assistant Setup prompt guides new users through enabling their own specific Siri settings; this is not essential and, therefore, _MUST_ be disabled to prevent against the risk of individuals electing Siri settings with the potential to override organization-wide settings.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.SetupAssistant.managed')\
  .objectForKey('SkipSiriSetup').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce: |-
    $OS_VALUE
  cci:
  - CCI-000381
  - CCI-001774
  800-53r5:
  - AC-20
  - CM-7
  - CM-7(1)
  800-53r4:
  - CM-7
  - CM-7(1)
  - AC-20
  srg:
  - SRG-OS-000095-GPOS-00049
  - SRG-OS-000370-GPOS-00155
  disa_stig: |-
    $OS_VALUE
  800-171r2:
  - 3.1.20
  - 3.4.6
  cis:
    benchmark:
    - N/A
    controls v8:
    - 4.1
    - 4.8
tags:
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- 800-53r4_low
- 800-53r4_moderate
- 800-53r4_high
- 800-171
- cnssi-1253
- cisv8
- stig
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.SetupAssistant.managed:
    SkipSiriSetup: true
OS_specifics:
  macOS:
    '12':
      references:
        cce:
        - CCE-91001-8
        disa_stig:
        - APPL-12-002039
    '11':
      references:
        cce:
        - CCE-85379-6
        disa_stig:
        - APPL-11-002039
    '10.15':
      references:
        cce:
        - CCE-84791-3
        disa_stig:
        - AOSX-15-002034
        - AOSX-15-002039
