id: os_skip_unlock_with_watch_enable
title: Disable Unlock with Apple Watch During Setup Assistant
discussion: "The prompt for Apple Watch unlock setup during Setup Assistant _MUST_\
  \ be disabled. \n\nDisabling Apple watches is a necessary step to ensuring that\
  \ the information system retains a session lock until the user reestablishes access\
  \ using an authorized identification and authentication procedures.\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.SetupAssistant.managed')\
  .objectForKey('SkipUnlockWithWatch').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce: |-
    $OS_VALUE
  cci:
  - CCI-000381
  800-53r5:
  - AC-20
  800-53r4:
  - AC-20
  srg:
  - SRG-OS-000095-GPOS-00049
  disa_stig: |-
    $OS_VALUE
  800-171r2:
  - 3.1.20
  cis:
    benchmark:
    - N/A
    controls v8:
    - 4.1
tags:
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- 800-53r4_low
- 800-53r4_moderate
- 800-53r4_high
- 800-171
- cnssi-1253
- cisv8
- stig
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.SetupAssistant.managed:
    SkipUnlockWithWatch: true
OS_specifics:
  macOS:
    '12':
      references:
        cce:
        - CCE-91002-6
        disa_stig:
        - APPL-12-005056
