id: os_skip_screen_time_prompt_enable
title: Disable Screen Time Prompt During Setup Assistant
discussion: The prompt for Screen Time setup during Setup Assistant _MUST_ be disabled.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.SetupAssistant.managed')\
  .objectForKey('SkipScreenTime').js
  EOS
result: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-000381
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    sfr:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - CM-7
      - CM-7(1)
    800-53r4:
      - CM-7
      - CM-7(1)
tags:
  - none
  - stig
severity: low
mobileconfig: true
mobileconfig_info:
  com.apple.SetupAssistant.managed:
    SkipScreenTime: true
os_specifics:
  macOS:
    '12.0':
      references:
        disa:
          disa_stig:
            - APPL-12-005055
          srg:
            - SRG-OS-000095-GPOS-00049
          sfr:
            - N/A
        nist:
          cce:
            - CCE-91113-1
    '13.0':
      references:
        disa:
          disa_stig:
            - N/A
          srg:
            - N/A
          sfr:
            - N/A
        nist:
          cce:
            - CCE-91880-5
