id: os_terminal_secure_keyboard_enable
title: Ensure Secure Keyboard Entry Terminal.app is Enabled
discussion: "Secure keyboard entry _MUST_ be enabled in Terminal.app. \n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.Terminal')\
  .objectForKey('SecureKeyboardEntry').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  800-53r5:
    - N/A
  800-53r4:
    - N/A
  disa_stig:
    - $OS_VALUE
  srg:
    - $OS_VALUE
  cci:
    - N/A
  800-171r2:
    - N/A
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - cis_lvl1
  - cis_lvl2
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.Terminal:
    SecureKeyboardEntry: true
os_specifics:
  '11.0':
    references:
      cce:
        - CCE-85515-5
      disa_stig:
        - N/A
      srg:
        - N/A
      cis:
        benchmark:
          - 5.11 (level 1)
        controls v8:
          - 4.8
  '12.0':
    references:
      cce:
        - CCE-91118-0
      disa_stig:
        - N/A
      srg:
        - N/A
      cis:
        benchmark:
          - 5.11 (level 1)
        controls v8:
          - 4.8
  '13.0':
    references:
      cce:
        - CCE-91900-1
      disa_stig:
        - N/A
      srg:
        - N/A
      cis:
        benchmark:
          - 6.4.1 (level 1)
        controls v8:
          - 4.8
