id: os_touchid_prompt_disable
title: Disable TouchID Prompt during Setup Assistant
discussion: |
  The prompt for TouchID during Setup Assistant _MUST_ be disabled.

  macOS prompts new users through enabling TouchID during Setup Assistant; this is not essential and, therefore, _MUST_ be disabled to prevent against the risk of individuals electing to enable TouchID to override organization-wide settings.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.SetupAssistant.managed')\
  .objectForKey('SkipTouchIDSetup').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  cci:
    - N/A
  800-53r5:
    - CM-6
  800-53r4:
    - CM-6
  srg:
    - $OS_VALUE
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - 3.4.1
    - 3.4.2
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.SetupAssistant.managed:
    SkipTouchIDSetup: true
os_specifics:
  '11.0':
    references:
      cce:
        - CCE-85393-7
      disa_stig:
        - N/A
      srg:
        - SRG-OS-000480-GPOS-00227
      cis:
        benchmark:
          - N/A
        controls v8:
          - 4.1
  '12.0':
    references:
      cce:
        - CCE-91020-8
      disa_stig:
        - APPL-12-005054
      srg:
        - SRG-OS-000095-GPOS-00049
      cis:
        benchmark:
          - N/A
        controls v8:
          - 4.1
  '13.0':
    references:
      cce:
        - CCE-91905-0
      disa_stig:
        - N/A
      srg:
        - N/A
      cis:
        benchmark:
          - N/A
        controls v8:
          - 4.1
