id: os_usb_accessories_when_locked_disable
title: Ensure Allow USB accessories while the device is locked is set to Disabled
discussion: |
  USB devices _MUST_ not be allowed to connect while the device is locked.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-000366
      - CCI-000097
      - CCI-000370
    sfr:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    srg:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - CM-8(3)
      - MP-7
      - SC-7(10)
      - SC-41
    800-171r2:
      - N/A
    800-53r4:
      - None
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - stig
severity: medium
supervised: true
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowUSBRestrictedMode: false
os_specifics:
  iOS:
    '16.0':
      references:
        disa:
          disa_stig:
            - AIOS-16-012200
          srg:
            - None
          sfr:
            - 'FMT_SMF_EXT.1.1 #47'
        nist:
          cce:
            - N/A
        cis:
          benchmark:
            - 3.2.1.19 (level 1 - Institutionally-Owned Devices)
          controls v8:
            - 1.2
