id: os_voice_dialing_when_locked_disabled
title: Ensure Allow voice dialing while device is locked is set to Disabled
discussion: |
  Voice dialing while the device is locked _MUST_ be disabled.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-000366
    sfr:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    srg:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - CM-7
      - CM-7(1)
    800-171r2:
      - N/A
    800-53r4:
      - None
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
  - stig
severity: medium
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowVoiceDialing: false
os_specifics:
  iOS:
    '16.0':
      references:
        disa:
          disa_stig:
            - AIOS-16-007300
          srg:
            - None
          sfr:
            - 'FMT_SMF_EXT.1.1 #8b'
        nist:
          cce:
            - N/A
        cis:
          benchmark:
            - 2.2.1.1 (level 1 - End-User Owned Devices)
            - 3.2.1.2 (level 1 - Institutionally-Owned Devices)
          controls v8:
            - 4.3
