id: icloud_drive_disable
title: Disable iCloud Document Sync
discussion: "The macOS built-in iCloud document synchronization service _MUST_ be disabled to prevent organizational data from being synchronized to personal or non-approved storage. \n\nApple's iCloud service does not provide an organization with enough control over the storage and access of data and, therefore, automated document synchronization _MUST_ be controlled by an organization approved service. \n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowCloudDocumentSync').js
  EOS
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-000381
      - CCI-001774
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
  nist:
    800-53r5:
      - AC-20
      - AC-20(1)
      - CM-7
      - CM-7(1)
      - SC-7(10)
    800-53r4:
      - CM-7
      - CM-7(1)
      - AC-20
      - AC-20(1)
    800-171r2:
      - 3.1.20
      - 3.4.6
    cce:
      - $OS_VALUE
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - stig
  - cisv8
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowCloudDocumentSync: false
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85286-3
        disa_stig:
          - APPL-11-002041
        srg:
          - SRG-OS-000095-GPOS-00049
          - SRG-OS-000370-GPOS-00155
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.1
            - 4.8
            - 15.3
    '12.0':
      references:
        cce:
          - CCE-90889-7
        disa_stig:
          - APPL-12-002041
        srg:
          - SRG-OS-000095-GPOS-00049
          - SRG-OS-000370-GPOS-00155
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.1
            - 4.8
            - 15.3
    '13.0':
      references:
        cce:
          - CCE-91745-0
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.1
            - 4.8
            - 15.3
