id: icloud_managed_apps_store_data_disabled
title: Ensure Managed Apps Storing Data in iCloud is Set to Disabled
discussion: |
  Managed Apps _MUST_ not store data in iCloud.
check: ' '
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-000097
      - CCI-000366
      - CCI-000370
    sfr:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    srg:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - AC-20
      - AC-20(1)
      - CM-7
      - CM-7(1)
      - SC-7(10)
    800-171r2:
      - N/A
    800-53r4:
      - None
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - ios
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - cis_lvl1_byod
  - cis_lvl2_byod
  - cis_lvl1_enterprise
  - cis_lvl2_enterprise
  - cisv8
severity: ''
supervised: false
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowManagedAppsCloudSync: false
os_specifics:
  iOS:
    '16.0':
      references:
        disa:
          disa_stig:
            - AIOS-16-003600
          srg:
            - None
          sfr:
            - 'FMT_MOF_EXT.1.2 #40'
        nist:
          cce:
            - N/A
        cis:
          benchmark:
            - 2.2.1.3 (level 1 - End-User Owned Devices)
            - 3.2.1.7 (level 1 - Institutionally-Owned Devices)
          controls v8:
            - 2.3
