id: icloud_appleid_prefpane_disable
title: Disable the System Preference Pane for Apple ID
discussion: "The system preference pane for Apple ID _MUST_ be disabled.\n\nDisabling the system preference pane prevents login to Apple ID and iCloud. \n"
check: |
  /usr/bin/profiles show -output stdout-xml | /usr/bin/xmllint --xpath '//key[text()="DisabledPreferencePanes"]/following-sibling::*[1]' - | /usr/bin/grep -c com.apple.preferences.AppleIDPrefPane
result:
  integer: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  cci:
    - CCI-001774
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
  800-53r4:
    - CM-7
    - CM-7(1)
    - AC-20
    - AC-20(1)
  srg:
    - $OS_VALUE
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - 3.1.20
    - 3.4.6
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - stig
  - cisv8
severity: high
mobileconfig: true
mobileconfig_info:
  com.apple.systempreferences:
    DisabledPreferencePanes:
      - com.apple.preferences.AppleIDPrefPane
os_specifics:
  '11.0':
    references:
      cce:
        - CCE-85283-0
      disa_stig:
        - APPL-11-002031
      srg:
        - SRG-OS-000370-GPOS-00155
      cis:
        benchmark:
          - N/A
        controls v8:
          - 4.1
          - 4.8
  '12.0':
    references:
      cce:
        - CCE-90886-3
      disa_stig:
        - APPL-12-002031
      srg:
        - SRG-OS-000370-GPOS-00155
      cis:
        benchmark:
          - N/A
        controls v8:
          - 4.1
          - 4.8
