id: icloud_sync_disable
title: Disable iCloud Desktop and Document Folder Sync
discussion: "The macOS system's ability to automatically synchronize a user's desktop and documents folder to their iCloud Drive _MUST_ be disabled.\n\nApple's iCloud service does not provide an organization with enough control over the storage and access of data and, therefore, automated file synchronization _MUST_ be controlled by an organization approved service. \n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowCloudDesktopAndDocuments').js
  EOS
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce:
    - $OS_VALUE
  cci:
    - N/A
  800-53r5:
    - AC-20
    - AC-20(1)
    - CM-7
    - CM-7(1)
    - SC-7(10)
  800-53r4:
    - CM-7
    - CM-7(1)
    - AC-20
    - AC-20(1)
  srg:
    - $OS_VALUE
  disa_stig:
    - $OS_VALUE
  800-171r2:
    - 3.1.20
    - 3.4.6
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cisv8
  - cis_lvl2
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowCloudDesktopAndDocuments: false
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85292-1
        disa_stig:
          - N/A
        srg:
          - SRG-OS-000095-GPOS-00049
          - SRG-OS-000370-GPOS-00155
        cis:
          benchmark:
            - 2.6.1.3 (level 2)
          controls v8:
            - 4.1
            - 4.8
            - 15.3
    '12.0':
      references:
        cce:
          - CCE-90896-2
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - 2.6.1.3 (level 2)
          controls v8:
            - 4.1
            - 4.8
            - 15.3
    '13.0':
      references:
        cce:
          - CCE-91752-6
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - 2.1.1.3 (level 2)
          controls v8:
            - 4.1
            - 4.8
            - 15.3
  ios:
    '16.0':
      references:
        cce:
          - N/A
        disa_stig:
          - AIOS-16-003200
        srg:
          - None
        cis:
          benchmark:
            - 3.2.1.5 (level 1 - Institutionally-Owned Devices)
          controls v8:
            - 2.3
