id: icloud_private_relay_disable
title: Disable iCloud Private Relay
discussion: |
  Enterprise networks may be required to audit all network traffic by policy, therefore, iCloud Private Relay _MUST_ be disabled.

  Network administrators can also prevent the use of this feature by blocking DNS resolution of mask.icloud.com and mask-h2.icloud.com.
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowCloudPrivateRelay').js
  EOS
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce: |-
    $OS_VALUE
  cci:
  - N/A
  800-53r5:
  - AC-20
  - AC-20(1)
  - CM-7
  - CM-7(1)
  - SC-7(10)
  800-53r4:
  - CM-7
  - CM-7(1)
  - AC-20
  - AC-20(1)
  srg:
  - N/A
  disa_stig: |-
    $OS_VALUE
  800-171r2:
  - 3.1.20
  - 3.4.6
  cis:
    benchmark:
    - N/A
    controls v8:
    - 4.1
    - 4.8
    - 15.3
tags:
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- 800-53r4_low
- 800-53r4_moderate
- 800-53r4_high
- 800-171
- cnssi-1253
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowCloudPrivateRelay: false
OS_specifics:
  macOS:
    '12':
      references:
        cce:
        - CCE-90894-7
        disa_stig:
        - N/A
