id: icloud_photos_disable
title: Disable iCloud Photo Library
discussion: "The macOS built-in Photos.app connection to Apple's iCloud service _MUST_ be disabled. \n\nApple's iCloud service does not provide an organization with enough control over the storage and access of data and, therefore, automated photo synchronization _MUST_ be controlled by an organization approved service. \n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowCloudPhotoLibrary').js
  EOS
result: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-000381
      - CCI-001774
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    sfr:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - AC-20
      - AC-20(1)
      - CM-7
      - CM-7(1)
      - SC-7(10)
    800-53r4:
      - CM-7
      - CM-7(1)
      - AC-20
      - AC-20(1)
    800-171r2:
      - 3.1.20
      - 3.4.6
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cisv8
  - stig
  - cnssi-1253
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowCloudPhotoLibrary: false
os_specifics:
  macOS:
    '11.0':
      references:
        disa:
          disa_stig:
            - APPL-11-002043
          srg:
            - SRG-OS-000095-GPOS-00049
            - SRG-OS-000370-GPOS-00155
          sfr:
            - N/A
        nist:
          cce:
            - CCE-85290-5
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.1
            - 4.8
            - 15.3
    '10.15':
      references:
        disa:
          disa_stig:
            - AOSX-15-002043
          srg:
            - SRG-OS-000095-GPOS-00049
            - SRG-OS-000370-GPOS-00155
          sfr:
            - N/A
        nist:
          cce:
            - CCE-84738-4
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.1
            - 4.8
            - 15.3
    '12.0':
      references:
        disa:
          disa_stig:
            - APPL-12-002043
          srg:
            - SRG-OS-000095-GPOS-00049
            - SRG-OS-000370-GPOS-00155
          sfr:
            - N/A
        nist:
          cce:
            - CCE-90893-9
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.1
            - 4.8
            - 15.3
    '13.0':
      references:
        disa:
          disa_stig:
            - N/A
          srg:
            - N/A
          sfr:
            - N/A
        nist:
          cce:
            - CCE-91749-2
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.1
            - 4.8
            - 15.3
