id: icloud_calendar_disable
title: Disable the iCloud Calendar Services
discussion: "The macOS built-in Calendar.app connection to Apple's iCloud service\
  \ _MUST_ be disabled. \n\nApple's iCloud service does not provide an organization\
  \ with enough control over the storage and access of data and, therefore, automated\
  \ calendar synchronization _MUST_ be controlled by an organization approved service.\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.applicationaccess')\
  .objectForKey('allowCloudCalendar').js
  EOS
result:
  string: 'false'
fix: |
  This is implemented by a Configuration Profile.
references:
  cce: |-
    $OS_VALUE
  cci:
  - CCI-000381
  - CCI-001774
  800-53r5:
  - AC-20
  - AC-20(1)
  - CM-7
  - CM-7(1)
  - SC-7(10)
  800-53r4:
  - CM-7
  - CM-7(1)
  - AC-20
  - AC-20(1)
  srg:
  - SRG-OS-000095-GPOS-00049
  - SRG-OS-000370-GPOS-00155
  disa_stig: |-
    $OS_VALUE
  800-171r2:
  - 3.1.20
  - 3.4.6
  cis:
    benchmark:
    - N/A
    controls v8:
    - 4.1
    - 4.8
    - 15.3
tags:
- 800-53r5_low
- 800-53r5_moderate
- 800-53r5_high
- 800-53r4_low
- 800-53r4_moderate
- 800-53r4_high
- 800-171
- cnssi-1253
- cisv8
- stig
severity: low
mobileconfig: true
mobileconfig_info:
  com.apple.applicationaccess:
    allowCloudCalendar: false
OS_specifics:
  macOS:
    '12':
      references:
        cce:
        - CCE-90888-9
        disa_stig:
        - APPL-12-002012
    '11':
      references:
        cce:
        - CCE-85285-5
        disa_stig:
        - APPL-11-002012
    '10.15':
      references:
        cce:
        - CCE-84733-5
        disa_stig:
        - AOSX-15-002012
