id: system_settings_bluetooth_disable
title: Disable Bluetooth When no Approved Device is Connected
discussion: "The macOS system _MUST_ be configured to disable Bluetooth unless there is an approved device connected.\n\n[IMPORTANT]\n====\nInformation System Security Officers (ISSOs) may make the risk-based decision not to disable Bluetooth, so as to maintain necessary functionality, but they are advised to first fully weigh the potential risks posed to their organization. \n====\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.MCXBluetooth')\
  .objectForKey('DisableBluetooth').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - N/A
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
  nist:
    800-53r5:
      - AC-18
      - SC-8
      - AC-18(3)
    800-53r4:
      - AC-18(3)
      - SC-8
    800-171r2:
      - 3.13.8
    cce:
      - $OS_VALUE
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-171
  - cisv8
severity: low
mobileconfig: true
mobileconfig_info:
  com.apple.ManagedClient.preferences:
    com.apple.MCXBluetooth:
      DisableBluetooth: true
os_specifics:
  macOS:
    '13.0':
      references:
        cce:
          - CCE-91936-5
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - N/A
          controls v8:
            - 4.8
            - 12.6
            - 13.9
