id: system_settings_bluetooth_prefpane_disable
title: Disable the Bluetooth System Preference Pane
discussion: |
  This is required for compliance with the DISA STIG for macOS.

  The domain *com.apple.systempreferences* has been deprecated by Apple in macOS 13. The recommended way to disable System Setting Panes is to use the *DisabledSystemSettings* key.

  link:https://developer.apple.com/documentation/devicemanagement/systempreferences[]
check: |
  /usr/bin/profiles show -output stdout-xml | /usr/bin/xmllint --xpath '//key[text()="DisabledPreferencePanes"]/following-sibling::*[1]' - | /usr/bin/grep -c com.apple.preferences.Bluetooth
result: 1
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - CCI-002418
      - CCI-001967
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
    sfr:
      - $OS_VALUE
  nist:
    cce:
      - $OS_VALUE
    800-53r5:
      - N/A
    800-53r4:
      - SC-8
    800-171r2:
      - N/A
tags:
  - stig
severity: low
mobileconfig: true
mobileconfig_info:
  com.apple.systempreferences:
    DisabledPreferencePanes:
      - com.apple.preferences.Bluetooth
os_specifics:
  macOS:
    '12.0':
      references:
        cce:
          - N/A
        disa_stig:
          - APPL-13-002062
        srg:
          - SRG-OS-000379-GPOS-00164
          - SRG-OS-000481-GPOS-00481
        sfr:
          - N/A
