id: system_settings_password_hints_disable
title: Disable Password Hints
discussion: "Password hints _MUST_ be disabled.\n\nPassword hints leak information about passwords that are currently in use and can lead to loss of confidentiality. \n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.loginwindow')\
  .objectForKey('RetriesUntilHint').js
  EOS
result:
  integer: 0
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - N/A
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
  nist:
    800-53r5:
      - IA-6
    800-53r4:
      - IA-6
    800-171r2:
      - 3.5.11
  cce:
    - $OS_VALUE
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - 800-171
  - cis_lvl1
  - cis_lvl2
  - cisv8
severity: medium
mobileconfig: true
mobileconfig_info:
  com.apple.loginwindow:
    RetriesUntilHint: 0
os_specifics:
  macOS:
    '13.0':
      references:
        cce:
          - CCE-91967-0
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - 2.10.5 (level 1)
          controls v8:
            - 4.1
