id: auth_smartcard_allow
title: Allow Smartcard Authentication
discussion: "Smartcard authentication _MUST_ be allowed. \n\nThe use of smartcard credentials facilitates standardization and reduces the risk of unauthorized access.\n\nWhen enabled, the smartcard can be used for login, authorization, and screen saver unlocking.\n"
check: |
  /usr/bin/osascript -l JavaScript << EOS
  $.NSUserDefaults.alloc.initWithSuiteName('com.apple.security.smartcard')\
  .objectForKey('allowSmartCard').js
  EOS
result:
  string: 'true'
fix: |
  This is implemented by a Configuration Profile.
references:
  disa:
    cci:
      - N/A
    srg:
      - $OS_VALUE
    disa_stig:
      - $OS_VALUE
  nist:
    800-53r5:
      - IA-2(1)
      - IA-2(2)
      - IA-2(12)
    800-53r4:
      - IA-2(12)
      - IA-5(11)
  cce:
    - $OS_VALUE
  cis:
    benchmark:
      - $OS_VALUE
    controls v8:
      - $OS_VALUE
tags:
  - 800-53r5_low
  - 800-53r5_moderate
  - 800-53r5_high
  - 800-53r4_low
  - 800-53r4_moderate
  - 800-53r4_high
  - cisv8
mobileconfig: true
mobileconfig_info:
  com.apple.security.smartcard:
    allowSmartCard: true
os_specifics:
  macOS:
    '11.0':
      references:
        cce:
          - CCE-85277-2
        disa_stig:
          - N/A
        srg:
          - SRG-OS-000376-GPOS-00161
        cis:
          benchmark:
            - N/A
          controls v8:
            - 6.3
            - 6.4
            - 6.5
    '12.0':
      references:
        cce:
          - CCE-90880-6
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - N/A
          controls v8:
            - 6.3
            - 6.4
            - 6.5
    '13.0':
      references:
        cce:
          - CCE-91736-9
        disa_stig:
          - N/A
        srg:
          - N/A
        cis:
          benchmark:
            - N/A
          controls v8:
            - 6.3
            - 6.4
            - 6.5
