Repository: brodjieski/macos_security
Catalog: config/locales/*/LC_MESSAGES/messages.po
Languages: de

source: Foreword
de: Vorwort

source: The macOS Security Compliance Project is an open source effort to provide a programmatic approach to generating security guidance. The configuration settings in this document were derived from National Institute of Standards and Technology (NIST) Special Publication (SP) 800-53, _Security and Privacy Controls for Information Systems and Organizations_, Revision 5.
de: Das macOS Security Compliance Project ist ein Open-Source-Projekt, das einen programmatischen Ansatz zur Erstellung von Sicherheitsrichtlinien bietet. Die Konfigurationseinstellungen in diesem Dokument stammen aus der Sonderveröffentlichung (SP) 800-53 des National Institute of Standards and Technology (NIST), Revision 5.

source: This project can be used as a resource to easily create customized security baselines of technical security controls by leveraging a library of atomic actions which are mapped to the compliance requirements defined in NIST SP 800-53 (Rev. 5). It can also be used to develop customized guidance to meet the particular cybersecurity needs of any organization.
de: Dieses Projekt dient als Ressource zur einfachen Erstellung individueller Sicherheitsgrundlagen für technische Sicherheitskontrollen. Dabei wird eine Bibliothek atomarer Aktionen genutzt, die den Compliance-Anforderungen des NIST SP 800-53 (Rev. 5) entsprechen. Darüber hinaus können damit individuelle Leitlinien entwickelt werden, die den spezifischen Cybersicherheitsanforderungen jeder Organisation gerecht werden.

source: The objective of this effort was to simplify and radically accelerate the process of producing up-to-date macOS security guidance that is also accessible to any organization and tailorable to meet each organization's specific security needs.
de: Ziel dieser Bemühungen war es, den Prozess der Erstellung aktueller macOS-Sicherheitsrichtlinien zu vereinfachen und drastisch zu beschleunigen. Diese Richtlinien sollen zudem für jedes Unternehmen zugänglich und an die spezifischen Sicherheitsanforderungen jedes Unternehmens anpassbar sein.

source: Any and all risk based decisions to tailor the content produced by this project in order to meet the needs of a specific organization shall be approved by the responsible Information System Owner (ISO) and Authorizing Official (AO) and formally documented in their System Security Plan (SSP). While the project attempts to provide settings to meet compliance requirements, it is recommended that each rule be reviewed by your organization's Information System Security Officer (ISSO) prior to implementation.
de: Alle risikobasierten Entscheidungen zur Anpassung der im Rahmen dieses Projekts erstellten Inhalte an die Anforderungen einer bestimmten Organisation müssen vom zuständigen Informationssysteminhaber (ISO) und dem zuständigen Autorisierungsbeauftragten (AO) genehmigt und im jeweiligen Systemsicherheitsplan (SSP) formal dokumentiert werden. Obwohl das Projekt versucht, Einstellungen zur Einhaltung der Compliance-Anforderungen bereitzustellen, wird empfohlen, jede Regel vor der Implementierung vom Informationssystemsicherheitsbeauftragten (ISSO) Ihrer Organisation zu überprüfen.

source: Scope
de: Umfang

source: Applicable Documents
de: Mitgeltende Unterlagen

source: Government Documents
de: Regierungsdokumente

source: Document Number or Descriptor
de: Dokumentnummer oder -beschreibung

source: Document Title
de: Dokumenttitel

source: Non-Government Documents
de: Nichtstaatliche Dokumente

source: This rule is marked as manual and may not be able to be automated. It is also excluded in the compliance scan and will not report any results.
de: Diese Regel ist als manuell gekennzeichnet und kann möglicherweise nicht automatisiert werden. Sie ist außerdem vom Compliance-Scan ausgeschlossen und meldet keine Ergebnisse.

source: To check the state of the system, run the following command(s)
de: Um den Status des Systems zu überprüfen, führen Sie die folgenden Befehle aus

source: If the result is not
de: Wenn das Ergebnis nicht

source: this is a finding
de: Das ist eine Erkenntnis

source: Remediation Description
de: Beschreibung der Sanierungsmaßnahme

source: Perform the following to configure the system to meet the requirements
de: Führen Sie die folgenden Schritte aus, um das System so zu konfigurieren, dass es die Anforderungen erfüllt

source: References
de: Referenzen

source: Operating System
de: Betriebssystem

source: This section contains the configuration and enforcement of operating system settings.
de: Dieser Abschnitt enthält die Konfiguration und Durchsetzung von Betriebssystemeinstellungen.
